Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/include/component/pps.h
/* -------- PPS_NMIR : (PPS Offset: 0x3C) (R/W 32)  -------- */
#define PPS_NMIR_RESETVALUE                   _UINT32_(0x00)                                       /*  (PPS_NMIR)   Reset Value */

#define PPS_NMIR_NMI_Pos                      _UINT32_(0)                                          /* (PPS_NMIR) NMI Position */
#define PPS_NMIR_NMI_Msk                      (_UINT32_(0xF) << PPS_NMIR_NMI_Pos)                  /* (PPS_NMIR) NMI Mask */
#define PPS_NMIR_NMI(value)                   (PPS_NMIR_NMI_Msk & (_UINT32_(value) << PPS_NMIR_NMI_Pos)) /* Assigment of value for NMI in the PPS_NMIR register */
#define   PPS_NMIR_NMI_RPA2_Val               _UINT32_(0xF)                                        /* (PPS_NMIR) RPA2  */
#define   PPS_NMIR_NMI_RPA6_Val               _UINT32_(0x1)                                        /* (PPS_NMIR) RPA6  */
#define   PPS_NMIR_NMI_RPA10_Val              _UINT32_(0x2)                                        /* (PPS_NMIR) RPA10  */
#define   PPS_NMIR_NMI_RPA14_Val              _UINT32_(0x3)                                        /* (PPS_NMIR) RPA14  */
#define   PPS_NMIR_NMI_RPB3_Val               _UINT32_(0x4)                                        /* (PPS_NMIR) RPB3  */
#define   PPS_NMIR_NMI_RPB7_Val               _UINT32_(0x5)                                        /* (PPS_NMIR) RPB7  */
#define   PPS_NMIR_NMI_RPB11_Val              _UINT32_(0x6)                                        /* (PPS_NMIR) RPB11  */
#define   PPS_NMIR_NMI_RPA1_Val               _UINT32_(0x7)                                        /* (PPS_NMIR) RPA1  */
#define   PPS_NMIR_NMI_RPA5_Val               _UINT32_(0x8)                                        /* (PPS_NMIR) RPA5  */
#define   PPS_NMIR_NMI_RPA9_Val               _UINT32_(0x9)                                        /* (PPS_NMIR) RPA9  */
#define   PPS_NMIR_NMI_RPA13_Val              _UINT32_(0xA)                                        /* (PPS_NMIR) RPA13  */
#define   PPS_NMIR_NMI_RPB2_Val               _UINT32_(0xB)                                        /* (PPS_NMIR) RPB2  */
#define   PPS_NMIR_NMI_RPB6_Val               _UINT32_(0xC)                                        /* (PPS_NMIR) RPB6  */
#define   PPS_NMIR_NMI_RPB10_Val              _UINT32_(0xD)                                        /* (PPS_NMIR) RPB10  */
#define   PPS_NMIR_NMI_RPA8_Val               _UINT32_(0xE)                                        /* (PPS_NMIR) RPA8  */
#define   PPS_NMIR_NMI_OFF_Val                _UINT32_(0x0)                                        /* (PPS_NMIR) OFF  */
#define PPS_NMIR_NMI_RPA2                     (PPS_NMIR_NMI_RPA2_Val << PPS_NMIR_NMI_Pos)          /* (PPS_NMIR) RPA2 Position  */
#define PPS_NMIR_NMI_RPA6                     (PPS_NMIR_NMI_RPA6_Val << PPS_NMIR_NMI_Pos)          /* (PPS_NMIR) RPA6 Position  */
#define PPS_NMIR_NMI_RPA10                    (PPS_NMIR_NMI_RPA10_Val << PPS_NMIR_NMI_Pos)         /* (PPS_NMIR) RPA10 Position  */
#define PPS_NMIR_NMI_RPA14                    (PPS_NMIR_NMI_RPA14_Val << PPS_NMIR_NMI_Pos)         /* (PPS_NMIR) RPA14 Position  */
#define PPS_NMIR_NMI_RPB3                     (PPS_NMIR_NMI_RPB3_Val << PPS_NMIR_NMI_Pos)          /* (PPS_NMIR) RPB3 Position  */
#define PPS_NMIR_NMI_RPB7                     (PPS_NMIR_NMI_RPB7_Val << PPS_NMIR_NMI_Pos)          /* (PPS_NMIR) RPB7 Position  */
#define PPS_NMIR_NMI_RPB11                    (PPS_NMIR_NMI_RPB11_Val << PPS_NMIR_NMI_Pos)         /* (PPS_NMIR) RPB11 Position  */
#define PPS_NMIR_NMI_RPA1                     (PPS_NMIR_NMI_RPA1_Val << PPS_NMIR_NMI_Pos)          /* (PPS_NMIR) RPA1 Position  */
#define PPS_NMIR_NMI_RPA5                     (PPS_NMIR_NMI_RPA5_Val << PPS_NMIR_NMI_Pos)          /* (PPS_NMIR) RPA5 Position  */
#define PPS_NMIR_NMI_RPA9                     (PPS_NMIR_NMI_RPA9_Val << PPS_NMIR_NMI_Pos)          /* (PPS_NMIR) RPA9 Position  */
#define PPS_NMIR_NMI_RPA13                    (PPS_NMIR_NMI_RPA13_Val << PPS_NMIR_NMI_Pos)         /* (PPS_NMIR) RPA13 Position  */
#define PPS_NMIR_NMI_RPB2                     (PPS_NMIR_NMI_RPB2_Val << PPS_NMIR_NMI_Pos)          /* (PPS_NMIR) RPB2 Position  */
#define PPS_NMIR_NMI_RPB6                     (PPS_NMIR_NMI_RPB6_Val << PPS_NMIR_NMI_Pos)          /* (PPS_NMIR) RPB6 Position  */
#define PPS_NMIR_NMI_RPB10                    (PPS_NMIR_NMI_RPB10_Val << PPS_NMIR_NMI_Pos)         /* (PPS_NMIR) RPB10 Position  */
#define PPS_NMIR_NMI_RPA8                     (PPS_NMIR_NMI_RPA8_Val << PPS_NMIR_NMI_Pos)          /* (PPS_NMIR) RPA8 Position  */
#define PPS_NMIR_NMI_OFF                      (PPS_NMIR_NMI_OFF_Val << PPS_NMIR_NMI_Pos)           /* (PPS_NMIR) OFF Position  */
#define PPS_NMIR_Msk                          _UINT32_(0x0000000F)                                 /* (PPS_NMIR) Register Mask  */


/* -------- PPS_SCOM0P0R : (PPS Offset: 0x40) (R/W 32)  -------- */
#define PPS_SCOM0P0R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM0P0R)   Reset Value */

#define PPS_SCOM0P0R_SCOM0P0_Pos              _UINT32_(0)                                          /* (PPS_SCOM0P0R) SERCOM0/PAD0 Position */
#define PPS_SCOM0P0R_SCOM0P0_Msk              (_UINT32_(0xF) << PPS_SCOM0P0R_SCOM0P0_Pos)          /* (PPS_SCOM0P0R) SERCOM0/PAD0 Mask */
#define PPS_SCOM0P0R_SCOM0P0(value)           (PPS_SCOM0P0R_SCOM0P0_Msk & (_UINT32_(value) << PPS_SCOM0P0R_SCOM0P0_Pos)) /* Assigment of value for SCOM0P0 in the PPS_SCOM0P0R register */
#define   PPS_SCOM0P0R_SCOM0P0_RPA0_Val       _UINT32_(0xF)                                        /* (PPS_SCOM0P0R) RPA0  */
#define   PPS_SCOM0P0R_SCOM0P0_RPA4_Val       _UINT32_(0x1)                                        /* (PPS_SCOM0P0R) RPA4  */
#define   PPS_SCOM0P0R_SCOM0P0_RPA8_Val       _UINT32_(0x2)                                        /* (PPS_SCOM0P0R) RPA8  */
#define   PPS_SCOM0P0R_SCOM0P0_RPA12_Val      _UINT32_(0x3)                                        /* (PPS_SCOM0P0R) RPA12  */
#define   PPS_SCOM0P0R_SCOM0P0_RPB1_Val       _UINT32_(0x4)                                        /* (PPS_SCOM0P0R) RPB1  */
#define   PPS_SCOM0P0R_SCOM0P0_RPB5_Val       _UINT32_(0x5)                                        /* (PPS_SCOM0P0R) RPB5  */
#define   PPS_SCOM0P0R_SCOM0P0_RPB9_Val       _UINT32_(0x6)                                        /* (PPS_SCOM0P0R) RPB9  */
#define   PPS_SCOM0P0R_SCOM0P0_RPB13_Val      _UINT32_(0x7)                                        /* (PPS_SCOM0P0R) RPB13  */
#define   PPS_SCOM0P0R_SCOM0P0_RPA3_Val       _UINT32_(0x8)                                        /* (PPS_SCOM0P0R) RPA3  */
#define   PPS_SCOM0P0R_SCOM0P0_RPA7_Val       _UINT32_(0x9)                                        /* (PPS_SCOM0P0R) RPA7  */
#define   PPS_SCOM0P0R_SCOM0P0_RPA11_Val      _UINT32_(0xA)                                        /* (PPS_SCOM0P0R) RPA11  */
#define   PPS_SCOM0P0R_SCOM0P0_RPB0_Val       _UINT32_(0xB)                                        /* (PPS_SCOM0P0R) RPB0  */
#define   PPS_SCOM0P0R_SCOM0P0_RPB4_Val       _UINT32_(0xC)                                        /* (PPS_SCOM0P0R) RPB4  */
#define   PPS_SCOM0P0R_SCOM0P0_RPB8_Val       _UINT32_(0xD)                                        /* (PPS_SCOM0P0R) RPB8  */
#define   PPS_SCOM0P0R_SCOM0P0_RPB12_Val      _UINT32_(0xE)                                        /* (PPS_SCOM0P0R) RPB12  */
#define   PPS_SCOM0P0R_SCOM0P0_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM0P0R) OFF  */
#define PPS_SCOM0P0R_SCOM0P0_RPA0             (PPS_SCOM0P0R_SCOM0P0_RPA0_Val << PPS_SCOM0P0R_SCOM0P0_Pos) /* (PPS_SCOM0P0R) RPA0 Position  */
#define PPS_SCOM0P0R_SCOM0P0_RPA4             (PPS_SCOM0P0R_SCOM0P0_RPA4_Val << PPS_SCOM0P0R_SCOM0P0_Pos) /* (PPS_SCOM0P0R) RPA4 Position  */
#define PPS_SCOM0P0R_SCOM0P0_RPA8             (PPS_SCOM0P0R_SCOM0P0_RPA8_Val << PPS_SCOM0P0R_SCOM0P0_Pos) /* (PPS_SCOM0P0R) RPA8 Position  */
#define PPS_SCOM0P0R_SCOM0P0_RPA12            (PPS_SCOM0P0R_SCOM0P0_RPA12_Val << PPS_SCOM0P0R_SCOM0P0_Pos) /* (PPS_SCOM0P0R) RPA12 Position  */
#define PPS_SCOM0P0R_SCOM0P0_RPB1             (PPS_SCOM0P0R_SCOM0P0_RPB1_Val << PPS_SCOM0P0R_SCOM0P0_Pos) /* (PPS_SCOM0P0R) RPB1 Position  */
#define PPS_SCOM0P0R_SCOM0P0_RPB5             (PPS_SCOM0P0R_SCOM0P0_RPB5_Val << PPS_SCOM0P0R_SCOM0P0_Pos) /* (PPS_SCOM0P0R) RPB5 Position  */
#define PPS_SCOM0P0R_SCOM0P0_RPB9             (PPS_SCOM0P0R_SCOM0P0_RPB9_Val << PPS_SCOM0P0R_SCOM0P0_Pos) /* (PPS_SCOM0P0R) RPB9 Position  */
#define PPS_SCOM0P0R_SCOM0P0_RPB13            (PPS_SCOM0P0R_SCOM0P0_RPB13_Val << PPS_SCOM0P0R_SCOM0P0_Pos) /* (PPS_SCOM0P0R) RPB13 Position  */
#define PPS_SCOM0P0R_SCOM0P0_RPA3             (PPS_SCOM0P0R_SCOM0P0_RPA3_Val << PPS_SCOM0P0R_SCOM0P0_Pos) /* (PPS_SCOM0P0R) RPA3 Position  */
#define PPS_SCOM0P0R_SCOM0P0_RPA7             (PPS_SCOM0P0R_SCOM0P0_RPA7_Val << PPS_SCOM0P0R_SCOM0P0_Pos) /* (PPS_SCOM0P0R) RPA7 Position  */
#define PPS_SCOM0P0R_SCOM0P0_RPA11            (PPS_SCOM0P0R_SCOM0P0_RPA11_Val << PPS_SCOM0P0R_SCOM0P0_Pos) /* (PPS_SCOM0P0R) RPA11 Position  */
#define PPS_SCOM0P0R_SCOM0P0_RPB0             (PPS_SCOM0P0R_SCOM0P0_RPB0_Val << PPS_SCOM0P0R_SCOM0P0_Pos) /* (PPS_SCOM0P0R) RPB0 Position  */
#define PPS_SCOM0P0R_SCOM0P0_RPB4             (PPS_SCOM0P0R_SCOM0P0_RPB4_Val << PPS_SCOM0P0R_SCOM0P0_Pos) /* (PPS_SCOM0P0R) RPB4 Position  */
#define PPS_SCOM0P0R_SCOM0P0_RPB8             (PPS_SCOM0P0R_SCOM0P0_RPB8_Val << PPS_SCOM0P0R_SCOM0P0_Pos) /* (PPS_SCOM0P0R) RPB8 Position  */
#define PPS_SCOM0P0R_SCOM0P0_RPB12            (PPS_SCOM0P0R_SCOM0P0_RPB12_Val << PPS_SCOM0P0R_SCOM0P0_Pos) /* (PPS_SCOM0P0R) RPB12 Position  */
#define PPS_SCOM0P0R_SCOM0P0_OFF              (PPS_SCOM0P0R_SCOM0P0_OFF_Val << PPS_SCOM0P0R_SCOM0P0_Pos) /* (PPS_SCOM0P0R) OFF Position  */
#define PPS_SCOM0P0R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_SCOM0P0R) Register Mask  */


/* -------- PPS_SCOM0P1R : (PPS Offset: 0x44) (R/W 32)  -------- */
#define PPS_SCOM0P1R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM0P1R)   Reset Value */

#define PPS_SCOM0P1R_SCOM0P1_Pos              _UINT32_(0)                                          /* (PPS_SCOM0P1R) SERCOM0/PAD1 Position */
#define PPS_SCOM0P1R_SCOM0P1_Msk              (_UINT32_(0xF) << PPS_SCOM0P1R_SCOM0P1_Pos)          /* (PPS_SCOM0P1R) SERCOM0/PAD1 Mask */
#define PPS_SCOM0P1R_SCOM0P1(value)           (PPS_SCOM0P1R_SCOM0P1_Msk & (_UINT32_(value) << PPS_SCOM0P1R_SCOM0P1_Pos)) /* Assigment of value for SCOM0P1 in the PPS_SCOM0P1R register */
#define   PPS_SCOM0P1R_SCOM0P1_RPA3_Val       _UINT32_(0x1)                                        /* (PPS_SCOM0P1R) RPA3  */
#define   PPS_SCOM0P1R_SCOM0P1_RPA5_Val       _UINT32_(0x2)                                        /* (PPS_SCOM0P1R) RPA5  */
#define   PPS_SCOM0P1R_SCOM0P1_RPA6_Val       _UINT32_(0x3)                                        /* (PPS_SCOM0P1R) RPA6  */
#define   PPS_SCOM0P1R_SCOM0P1_RPA7_Val       _UINT32_(0x4)                                        /* (PPS_SCOM0P1R) RPA7  */
#define   PPS_SCOM0P1R_SCOM0P1_RPB5_Val       _UINT32_(0x5)                                        /* (PPS_SCOM0P1R) RPB5  */
#define   PPS_SCOM0P1R_SCOM0P1_RPB6_Val       _UINT32_(0x6)                                        /* (PPS_SCOM0P1R) RPB6  */
#define   PPS_SCOM0P1R_SCOM0P1_RPB8_Val       _UINT32_(0x7)                                        /* (PPS_SCOM0P1R) RPB8  */
#define   PPS_SCOM0P1R_SCOM0P1_RPB9_Val       _UINT32_(0x8)                                        /* (PPS_SCOM0P1R) RPB9  */
#define   PPS_SCOM0P1R_SCOM0P1_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM0P1R) OFF  */
#define PPS_SCOM0P1R_SCOM0P1_RPA3             (PPS_SCOM0P1R_SCOM0P1_RPA3_Val << PPS_SCOM0P1R_SCOM0P1_Pos) /* (PPS_SCOM0P1R) RPA3 Position  */
#define PPS_SCOM0P1R_SCOM0P1_RPA5             (PPS_SCOM0P1R_SCOM0P1_RPA5_Val << PPS_SCOM0P1R_SCOM0P1_Pos) /* (PPS_SCOM0P1R) RPA5 Position  */
#define PPS_SCOM0P1R_SCOM0P1_RPA6             (PPS_SCOM0P1R_SCOM0P1_RPA6_Val << PPS_SCOM0P1R_SCOM0P1_Pos) /* (PPS_SCOM0P1R) RPA6 Position  */
#define PPS_SCOM0P1R_SCOM0P1_RPA7             (PPS_SCOM0P1R_SCOM0P1_RPA7_Val << PPS_SCOM0P1R_SCOM0P1_Pos) /* (PPS_SCOM0P1R) RPA7 Position  */
#define PPS_SCOM0P1R_SCOM0P1_RPB5             (PPS_SCOM0P1R_SCOM0P1_RPB5_Val << PPS_SCOM0P1R_SCOM0P1_Pos) /* (PPS_SCOM0P1R) RPB5 Position  */
#define PPS_SCOM0P1R_SCOM0P1_RPB6             (PPS_SCOM0P1R_SCOM0P1_RPB6_Val << PPS_SCOM0P1R_SCOM0P1_Pos) /* (PPS_SCOM0P1R) RPB6 Position  */
#define PPS_SCOM0P1R_SCOM0P1_RPB8             (PPS_SCOM0P1R_SCOM0P1_RPB8_Val << PPS_SCOM0P1R_SCOM0P1_Pos) /* (PPS_SCOM0P1R) RPB8 Position  */
#define PPS_SCOM0P1R_SCOM0P1_RPB9             (PPS_SCOM0P1R_SCOM0P1_RPB9_Val << PPS_SCOM0P1R_SCOM0P1_Pos) /* (PPS_SCOM0P1R) RPB9 Position  */
#define PPS_SCOM0P1R_SCOM0P1_OFF              (PPS_SCOM0P1R_SCOM0P1_OFF_Val << PPS_SCOM0P1R_SCOM0P1_Pos) /* (PPS_SCOM0P1R) OFF Position  */
#define PPS_SCOM0P1R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_SCOM0P1R) Register Mask  */


/* -------- PPS_SCOM0P2R : (PPS Offset: 0x48) (R/W 32)  -------- */
#define PPS_SCOM0P2R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM0P2R)   Reset Value */

#define PPS_SCOM0P2R_SCOM0P2_Pos              _UINT32_(0)                                          /* (PPS_SCOM0P2R) SERCOM0/PAD2 Position */
#define PPS_SCOM0P2R_SCOM0P2_Msk              (_UINT32_(0xF) << PPS_SCOM0P2R_SCOM0P2_Pos)          /* (PPS_SCOM0P2R) SERCOM0/PAD2 Mask */
#define PPS_SCOM0P2R_SCOM0P2(value)           (PPS_SCOM0P2R_SCOM0P2_Msk & (_UINT32_(value) << PPS_SCOM0P2R_SCOM0P2_Pos)) /* Assigment of value for SCOM0P2 in the PPS_SCOM0P2R register */
#define   PPS_SCOM0P2R_SCOM0P2_RPA2_Val       _UINT32_(0xF)                                        /* (PPS_SCOM0P2R) RPA2  */
#define   PPS_SCOM0P2R_SCOM0P2_RPA6_Val       _UINT32_(0x1)                                        /* (PPS_SCOM0P2R) RPA6  */
#define   PPS_SCOM0P2R_SCOM0P2_RPA10_Val      _UINT32_(0x2)                                        /* (PPS_SCOM0P2R) RPA10  */
#define   PPS_SCOM0P2R_SCOM0P2_RPA14_Val      _UINT32_(0x3)                                        /* (PPS_SCOM0P2R) RPA14  */
#define   PPS_SCOM0P2R_SCOM0P2_RPB3_Val       _UINT32_(0x4)                                        /* (PPS_SCOM0P2R) RPB3  */
#define   PPS_SCOM0P2R_SCOM0P2_RPB7_Val       _UINT32_(0x5)                                        /* (PPS_SCOM0P2R) RPB7  */
#define   PPS_SCOM0P2R_SCOM0P2_RPB11_Val      _UINT32_(0x6)                                        /* (PPS_SCOM0P2R) RPB11  */
#define   PPS_SCOM0P2R_SCOM0P2_RPA1_Val       _UINT32_(0x7)                                        /* (PPS_SCOM0P2R) RPA1  */
#define   PPS_SCOM0P2R_SCOM0P2_RPA5_Val       _UINT32_(0x8)                                        /* (PPS_SCOM0P2R) RPA5  */
#define   PPS_SCOM0P2R_SCOM0P2_RPA9_Val       _UINT32_(0x9)                                        /* (PPS_SCOM0P2R) RPA9  */
#define   PPS_SCOM0P2R_SCOM0P2_RPA13_Val      _UINT32_(0xA)                                        /* (PPS_SCOM0P2R) RPA13  */
#define   PPS_SCOM0P2R_SCOM0P2_RPB2_Val       _UINT32_(0xB)                                        /* (PPS_SCOM0P2R) RPB2  */
#define   PPS_SCOM0P2R_SCOM0P2_RPB6_Val       _UINT32_(0xC)                                        /* (PPS_SCOM0P2R) RPB6  */
#define   PPS_SCOM0P2R_SCOM0P2_RPB10_Val      _UINT32_(0xD)                                        /* (PPS_SCOM0P2R) RPB10  */
#define   PPS_SCOM0P2R_SCOM0P2_RPA8_Val       _UINT32_(0xE)                                        /* (PPS_SCOM0P2R) RPA8  */
#define   PPS_SCOM0P2R_SCOM0P2_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM0P2R) OFF  */
#define PPS_SCOM0P2R_SCOM0P2_RPA2             (PPS_SCOM0P2R_SCOM0P2_RPA2_Val << PPS_SCOM0P2R_SCOM0P2_Pos) /* (PPS_SCOM0P2R) RPA2 Position  */
#define PPS_SCOM0P2R_SCOM0P2_RPA6             (PPS_SCOM0P2R_SCOM0P2_RPA6_Val << PPS_SCOM0P2R_SCOM0P2_Pos) /* (PPS_SCOM0P2R) RPA6 Position  */
#define PPS_SCOM0P2R_SCOM0P2_RPA10            (PPS_SCOM0P2R_SCOM0P2_RPA10_Val << PPS_SCOM0P2R_SCOM0P2_Pos) /* (PPS_SCOM0P2R) RPA10 Position  */
#define PPS_SCOM0P2R_SCOM0P2_RPA14            (PPS_SCOM0P2R_SCOM0P2_RPA14_Val << PPS_SCOM0P2R_SCOM0P2_Pos) /* (PPS_SCOM0P2R) RPA14 Position  */
#define PPS_SCOM0P2R_SCOM0P2_RPB3             (PPS_SCOM0P2R_SCOM0P2_RPB3_Val << PPS_SCOM0P2R_SCOM0P2_Pos) /* (PPS_SCOM0P2R) RPB3 Position  */
#define PPS_SCOM0P2R_SCOM0P2_RPB7             (PPS_SCOM0P2R_SCOM0P2_RPB7_Val << PPS_SCOM0P2R_SCOM0P2_Pos) /* (PPS_SCOM0P2R) RPB7 Position  */
#define PPS_SCOM0P2R_SCOM0P2_RPB11            (PPS_SCOM0P2R_SCOM0P2_RPB11_Val << PPS_SCOM0P2R_SCOM0P2_Pos) /* (PPS_SCOM0P2R) RPB11 Position  */
#define PPS_SCOM0P2R_SCOM0P2_RPA1             (PPS_SCOM0P2R_SCOM0P2_RPA1_Val << PPS_SCOM0P2R_SCOM0P2_Pos) /* (PPS_SCOM0P2R) RPA1 Position  */
#define PPS_SCOM0P2R_SCOM0P2_RPA5             (PPS_SCOM0P2R_SCOM0P2_RPA5_Val << PPS_SCOM0P2R_SCOM0P2_Pos) /* (PPS_SCOM0P2R) RPA5 Position  */
#define PPS_SCOM0P2R_SCOM0P2_RPA9             (PPS_SCOM0P2R_SCOM0P2_RPA9_Val << PPS_SCOM0P2R_SCOM0P2_Pos) /* (PPS_SCOM0P2R) RPA9 Position  */
#define PPS_SCOM0P2R_SCOM0P2_RPA13            (PPS_SCOM0P2R_SCOM0P2_RPA13_Val << PPS_SCOM0P2R_SCOM0P2_Pos) /* (PPS_SCOM0P2R) RPA13 Position  */
#define PPS_SCOM0P2R_SCOM0P2_RPB2             (PPS_SCOM0P2R_SCOM0P2_RPB2_Val << PPS_SCOM0P2R_SCOM0P2_Pos) /* (PPS_SCOM0P2R) RPB2 Position  */
#define PPS_SCOM0P2R_SCOM0P2_RPB6             (PPS_SCOM0P2R_SCOM0P2_RPB6_Val << PPS_SCOM0P2R_SCOM0P2_Pos) /* (PPS_SCOM0P2R) RPB6 Position  */
#define PPS_SCOM0P2R_SCOM0P2_RPB10            (PPS_SCOM0P2R_SCOM0P2_RPB10_Val << PPS_SCOM0P2R_SCOM0P2_Pos) /* (PPS_SCOM0P2R) RPB10 Position  */
#define PPS_SCOM0P2R_SCOM0P2_RPA8             (PPS_SCOM0P2R_SCOM0P2_RPA8_Val << PPS_SCOM0P2R_SCOM0P2_Pos) /* (PPS_SCOM0P2R) RPA8 Position  */
#define PPS_SCOM0P2R_SCOM0P2_OFF              (PPS_SCOM0P2R_SCOM0P2_OFF_Val << PPS_SCOM0P2R_SCOM0P2_Pos) /* (PPS_SCOM0P2R) OFF Position  */
#define PPS_SCOM0P2R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_SCOM0P2R) Register Mask  */


/* -------- PPS_SCOM0P3R : (PPS Offset: 0x4C) (R/W 32)  -------- */
#define PPS_SCOM0P3R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM0P3R)   Reset Value */

