Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/include/component/pps.h
#define PPS_CCLIN1R_CCLIN1_Pos                _UINT32_(0)                                          /* (PPS_CCLIN1R) CCL/IN1 Position */
#define PPS_CCLIN1R_CCLIN1_Msk                (_UINT32_(0xF) << PPS_CCLIN1R_CCLIN1_Pos)            /* (PPS_CCLIN1R) CCL/IN1 Mask */
#define PPS_CCLIN1R_CCLIN1(value)             (PPS_CCLIN1R_CCLIN1_Msk & (_UINT32_(value) << PPS_CCLIN1R_CCLIN1_Pos)) /* Assigment of value for CCLIN1 in the PPS_CCLIN1R register */
#define   PPS_CCLIN1R_CCLIN1_RPA0_Val         _UINT32_(0xF)                                        /* (PPS_CCLIN1R) RPA0  */
#define   PPS_CCLIN1R_CCLIN1_RPA4_Val         _UINT32_(0x1)                                        /* (PPS_CCLIN1R) RPA4  */
#define   PPS_CCLIN1R_CCLIN1_RPA8_Val         _UINT32_(0x2)                                        /* (PPS_CCLIN1R) RPA8  */
#define   PPS_CCLIN1R_CCLIN1_RPA12_Val        _UINT32_(0x3)                                        /* (PPS_CCLIN1R) RPA12  */
#define   PPS_CCLIN1R_CCLIN1_RPB1_Val         _UINT32_(0x4)                                        /* (PPS_CCLIN1R) RPB1  */
#define   PPS_CCLIN1R_CCLIN1_RPB5_Val         _UINT32_(0x5)                                        /* (PPS_CCLIN1R) RPB5  */
#define   PPS_CCLIN1R_CCLIN1_RPB9_Val         _UINT32_(0x6)                                        /* (PPS_CCLIN1R) RPB9  */
#define   PPS_CCLIN1R_CCLIN1_RPB13_Val        _UINT32_(0x7)                                        /* (PPS_CCLIN1R) RPB13  */
#define   PPS_CCLIN1R_CCLIN1_RPA3_Val         _UINT32_(0x8)                                        /* (PPS_CCLIN1R) RPA3  */
#define   PPS_CCLIN1R_CCLIN1_RPA7_Val         _UINT32_(0x9)                                        /* (PPS_CCLIN1R) RPA7  */
#define   PPS_CCLIN1R_CCLIN1_RPA11_Val        _UINT32_(0xA)                                        /* (PPS_CCLIN1R) RPA11  */
#define   PPS_CCLIN1R_CCLIN1_RPB0_Val         _UINT32_(0xB)                                        /* (PPS_CCLIN1R) RPB0  */
#define   PPS_CCLIN1R_CCLIN1_RPB4_Val         _UINT32_(0xC)                                        /* (PPS_CCLIN1R) RPB4  */
#define   PPS_CCLIN1R_CCLIN1_RPB8_Val         _UINT32_(0xD)                                        /* (PPS_CCLIN1R) RPB8  */
#define   PPS_CCLIN1R_CCLIN1_RPB12_Val        _UINT32_(0xE)                                        /* (PPS_CCLIN1R) RPB12  */
#define   PPS_CCLIN1R_CCLIN1_OFF_Val          _UINT32_(0x0)                                        /* (PPS_CCLIN1R) OFF  */
#define PPS_CCLIN1R_CCLIN1_RPA0               (PPS_CCLIN1R_CCLIN1_RPA0_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPA0 Position  */
#define PPS_CCLIN1R_CCLIN1_RPA4               (PPS_CCLIN1R_CCLIN1_RPA4_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPA4 Position  */
#define PPS_CCLIN1R_CCLIN1_RPA8               (PPS_CCLIN1R_CCLIN1_RPA8_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPA8 Position  */
#define PPS_CCLIN1R_CCLIN1_RPA12              (PPS_CCLIN1R_CCLIN1_RPA12_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPA12 Position  */
#define PPS_CCLIN1R_CCLIN1_RPB1               (PPS_CCLIN1R_CCLIN1_RPB1_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB1 Position  */
#define PPS_CCLIN1R_CCLIN1_RPB5               (PPS_CCLIN1R_CCLIN1_RPB5_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB5 Position  */
#define PPS_CCLIN1R_CCLIN1_RPB9               (PPS_CCLIN1R_CCLIN1_RPB9_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB9 Position  */
#define PPS_CCLIN1R_CCLIN1_RPB13              (PPS_CCLIN1R_CCLIN1_RPB13_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB13 Position  */
#define PPS_CCLIN1R_CCLIN1_RPA3               (PPS_CCLIN1R_CCLIN1_RPA3_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPA3 Position  */
#define PPS_CCLIN1R_CCLIN1_RPA7               (PPS_CCLIN1R_CCLIN1_RPA7_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPA7 Position  */
#define PPS_CCLIN1R_CCLIN1_RPA11              (PPS_CCLIN1R_CCLIN1_RPA11_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPA11 Position  */
#define PPS_CCLIN1R_CCLIN1_RPB0               (PPS_CCLIN1R_CCLIN1_RPB0_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB0 Position  */
#define PPS_CCLIN1R_CCLIN1_RPB4               (PPS_CCLIN1R_CCLIN1_RPB4_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB4 Position  */
#define PPS_CCLIN1R_CCLIN1_RPB8               (PPS_CCLIN1R_CCLIN1_RPB8_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB8 Position  */
#define PPS_CCLIN1R_CCLIN1_RPB12              (PPS_CCLIN1R_CCLIN1_RPB12_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB12 Position  */
#define PPS_CCLIN1R_CCLIN1_OFF                (PPS_CCLIN1R_CCLIN1_OFF_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) OFF Position  */
#define PPS_CCLIN1R_Msk                       _UINT32_(0x0000000F)                                 /* (PPS_CCLIN1R) Register Mask  */


/* -------- PPS_CCLIN2R : (PPS Offset: 0xA0) (R/W 32)  -------- */
#define PPS_CCLIN2R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_CCLIN2R)   Reset Value */

#define PPS_CCLIN2R_CCLIN2_Pos                _UINT32_(0)                                          /* (PPS_CCLIN2R) CCL/IN2 Position */
#define PPS_CCLIN2R_CCLIN2_Msk                (_UINT32_(0xF) << PPS_CCLIN2R_CCLIN2_Pos)            /* (PPS_CCLIN2R) CCL/IN2 Mask */
#define PPS_CCLIN2R_CCLIN2(value)             (PPS_CCLIN2R_CCLIN2_Msk & (_UINT32_(value) << PPS_CCLIN2R_CCLIN2_Pos)) /* Assigment of value for CCLIN2 in the PPS_CCLIN2R register */
#define   PPS_CCLIN2R_CCLIN2_RPA1_Val         _UINT32_(0xF)                                        /* (PPS_CCLIN2R) RPA1  */
#define   PPS_CCLIN2R_CCLIN2_RPA5_Val         _UINT32_(0x1)                                        /* (PPS_CCLIN2R) RPA5  */
#define   PPS_CCLIN2R_CCLIN2_RPA9_Val         _UINT32_(0x2)                                        /* (PPS_CCLIN2R) RPA9  */
#define   PPS_CCLIN2R_CCLIN2_RPA13_Val        _UINT32_(0x3)                                        /* (PPS_CCLIN2R) RPA13  */
#define   PPS_CCLIN2R_CCLIN2_RPB2_Val         _UINT32_(0x4)                                        /* (PPS_CCLIN2R) RPB2  */
#define   PPS_CCLIN2R_CCLIN2_RPB6_Val         _UINT32_(0x5)                                        /* (PPS_CCLIN2R) RPB6  */
#define   PPS_CCLIN2R_CCLIN2_RPB10_Val        _UINT32_(0x6)                                        /* (PPS_CCLIN2R) RPB10  */
#define   PPS_CCLIN2R_CCLIN2_RPA0_Val         _UINT32_(0x7)                                        /* (PPS_CCLIN2R) RPA0  */
#define   PPS_CCLIN2R_CCLIN2_RPA4_Val         _UINT32_(0x8)                                        /* (PPS_CCLIN2R) RPA4  */
#define   PPS_CCLIN2R_CCLIN2_RPA8_Val         _UINT32_(0x9)                                        /* (PPS_CCLIN2R) RPA8  */
#define   PPS_CCLIN2R_CCLIN2_RPA12_Val        _UINT32_(0xA)                                        /* (PPS_CCLIN2R) RPA12  */
#define   PPS_CCLIN2R_CCLIN2_RPB1_Val         _UINT32_(0xB)                                        /* (PPS_CCLIN2R) RPB1  */
#define   PPS_CCLIN2R_CCLIN2_RPB5_Val         _UINT32_(0xC)                                        /* (PPS_CCLIN2R) RPB5  */
#define   PPS_CCLIN2R_CCLIN2_RPB9_Val         _UINT32_(0xD)                                        /* (PPS_CCLIN2R) RPB9  */
#define   PPS_CCLIN2R_CCLIN2_RPB13_Val        _UINT32_(0xE)                                        /* (PPS_CCLIN2R) RPB13  */
#define   PPS_CCLIN2R_CCLIN2_OFF_Val          _UINT32_(0x0)                                        /* (PPS_CCLIN2R) OFF  */
#define PPS_CCLIN2R_CCLIN2_RPA1               (PPS_CCLIN2R_CCLIN2_RPA1_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPA1 Position  */
#define PPS_CCLIN2R_CCLIN2_RPA5               (PPS_CCLIN2R_CCLIN2_RPA5_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPA5 Position  */
#define PPS_CCLIN2R_CCLIN2_RPA9               (PPS_CCLIN2R_CCLIN2_RPA9_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPA9 Position  */
#define PPS_CCLIN2R_CCLIN2_RPA13              (PPS_CCLIN2R_CCLIN2_RPA13_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPA13 Position  */
#define PPS_CCLIN2R_CCLIN2_RPB2               (PPS_CCLIN2R_CCLIN2_RPB2_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPB2 Position  */
#define PPS_CCLIN2R_CCLIN2_RPB6               (PPS_CCLIN2R_CCLIN2_RPB6_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPB6 Position  */
#define PPS_CCLIN2R_CCLIN2_RPB10              (PPS_CCLIN2R_CCLIN2_RPB10_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPB10 Position  */
#define PPS_CCLIN2R_CCLIN2_RPA0               (PPS_CCLIN2R_CCLIN2_RPA0_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPA0 Position  */
#define PPS_CCLIN2R_CCLIN2_RPA4               (PPS_CCLIN2R_CCLIN2_RPA4_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPA4 Position  */
#define PPS_CCLIN2R_CCLIN2_RPA8               (PPS_CCLIN2R_CCLIN2_RPA8_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPA8 Position  */
#define PPS_CCLIN2R_CCLIN2_RPA12              (PPS_CCLIN2R_CCLIN2_RPA12_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPA12 Position  */
#define PPS_CCLIN2R_CCLIN2_RPB1               (PPS_CCLIN2R_CCLIN2_RPB1_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPB1 Position  */
#define PPS_CCLIN2R_CCLIN2_RPB5               (PPS_CCLIN2R_CCLIN2_RPB5_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPB5 Position  */
#define PPS_CCLIN2R_CCLIN2_RPB9               (PPS_CCLIN2R_CCLIN2_RPB9_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPB9 Position  */
#define PPS_CCLIN2R_CCLIN2_RPB13              (PPS_CCLIN2R_CCLIN2_RPB13_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPB13 Position  */
#define PPS_CCLIN2R_CCLIN2_OFF                (PPS_CCLIN2R_CCLIN2_OFF_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) OFF Position  */
#define PPS_CCLIN2R_Msk                       _UINT32_(0x0000000F)                                 /* (PPS_CCLIN2R) Register Mask  */


/* -------- PPS_CCLIN3R : (PPS Offset: 0xA4) (R/W 32)  -------- */
#define PPS_CCLIN3R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_CCLIN3R)   Reset Value */

#define PPS_CCLIN3R_CCLIN3_Pos                _UINT32_(0)                                          /* (PPS_CCLIN3R) CCL/IN3 Position */
#define PPS_CCLIN3R_CCLIN3_Msk                (_UINT32_(0xF) << PPS_CCLIN3R_CCLIN3_Pos)            /* (PPS_CCLIN3R) CCL/IN3 Mask */
#define PPS_CCLIN3R_CCLIN3(value)             (PPS_CCLIN3R_CCLIN3_Msk & (_UINT32_(value) << PPS_CCLIN3R_CCLIN3_Pos)) /* Assigment of value for CCLIN3 in the PPS_CCLIN3R register */
#define   PPS_CCLIN3R_CCLIN3_RPA9_Val         _UINT32_(0xF)                                        /* (PPS_CCLIN3R) RPA9  */
#define   PPS_CCLIN3R_CCLIN3_RPA3_Val         _UINT32_(0x1)                                        /* (PPS_CCLIN3R) RPA3  */
#define   PPS_CCLIN3R_CCLIN3_RPA7_Val         _UINT32_(0x2)                                        /* (PPS_CCLIN3R) RPA7  */
#define   PPS_CCLIN3R_CCLIN3_RPA11_Val        _UINT32_(0x3)                                        /* (PPS_CCLIN3R) RPA11  */
#define   PPS_CCLIN3R_CCLIN3_RPB0_Val         _UINT32_(0x4)                                        /* (PPS_CCLIN3R) RPB0  */
#define   PPS_CCLIN3R_CCLIN3_RPB4_Val         _UINT32_(0x5)                                        /* (PPS_CCLIN3R) RPB4  */
#define   PPS_CCLIN3R_CCLIN3_RPB8_Val         _UINT32_(0x6)                                        /* (PPS_CCLIN3R) RPB8  */
#define   PPS_CCLIN3R_CCLIN3_RPB12_Val        _UINT32_(0x7)                                        /* (PPS_CCLIN3R) RPB12  */
#define   PPS_CCLIN3R_CCLIN3_RPA2_Val         _UINT32_(0x8)                                        /* (PPS_CCLIN3R) RPA2  */
#define   PPS_CCLIN3R_CCLIN3_RPA6_Val         _UINT32_(0x9)                                        /* (PPS_CCLIN3R) RPA6  */
#define   PPS_CCLIN3R_CCLIN3_RPA10_Val        _UINT32_(0xA)                                        /* (PPS_CCLIN3R) RPA10  */
#define   PPS_CCLIN3R_CCLIN3_RPA14_Val        _UINT32_(0xB)                                        /* (PPS_CCLIN3R) RPA14  */
#define   PPS_CCLIN3R_CCLIN3_RPB3_Val         _UINT32_(0xC)                                        /* (PPS_CCLIN3R) RPB3  */
#define   PPS_CCLIN3R_CCLIN3_RPB7_Val         _UINT32_(0xD)                                        /* (PPS_CCLIN3R) RPB7  */
#define   PPS_CCLIN3R_CCLIN3_RPB11_Val        _UINT32_(0xE)                                        /* (PPS_CCLIN3R) RPB11  */
#define   PPS_CCLIN3R_CCLIN3_OFF_Val          _UINT32_(0x0)                                        /* (PPS_CCLIN3R) OFF  */
#define PPS_CCLIN3R_CCLIN3_RPA9               (PPS_CCLIN3R_CCLIN3_RPA9_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPA9 Position  */
#define PPS_CCLIN3R_CCLIN3_RPA3               (PPS_CCLIN3R_CCLIN3_RPA3_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPA3 Position  */
#define PPS_CCLIN3R_CCLIN3_RPA7               (PPS_CCLIN3R_CCLIN3_RPA7_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPA7 Position  */
#define PPS_CCLIN3R_CCLIN3_RPA11              (PPS_CCLIN3R_CCLIN3_RPA11_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPA11 Position  */
#define PPS_CCLIN3R_CCLIN3_RPB0               (PPS_CCLIN3R_CCLIN3_RPB0_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPB0 Position  */
#define PPS_CCLIN3R_CCLIN3_RPB4               (PPS_CCLIN3R_CCLIN3_RPB4_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPB4 Position  */
#define PPS_CCLIN3R_CCLIN3_RPB8               (PPS_CCLIN3R_CCLIN3_RPB8_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPB8 Position  */
#define PPS_CCLIN3R_CCLIN3_RPB12              (PPS_CCLIN3R_CCLIN3_RPB12_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPB12 Position  */
#define PPS_CCLIN3R_CCLIN3_RPA2               (PPS_CCLIN3R_CCLIN3_RPA2_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPA2 Position  */
#define PPS_CCLIN3R_CCLIN3_RPA6               (PPS_CCLIN3R_CCLIN3_RPA6_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPA6 Position  */
#define PPS_CCLIN3R_CCLIN3_RPA10              (PPS_CCLIN3R_CCLIN3_RPA10_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPA10 Position  */
#define PPS_CCLIN3R_CCLIN3_RPA14              (PPS_CCLIN3R_CCLIN3_RPA14_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPA14 Position  */
#define PPS_CCLIN3R_CCLIN3_RPB3               (PPS_CCLIN3R_CCLIN3_RPB3_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPB3 Position  */
#define PPS_CCLIN3R_CCLIN3_RPB7               (PPS_CCLIN3R_CCLIN3_RPB7_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPB7 Position  */
#define PPS_CCLIN3R_CCLIN3_RPB11              (PPS_CCLIN3R_CCLIN3_RPB11_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPB11 Position  */
#define PPS_CCLIN3R_CCLIN3_OFF                (PPS_CCLIN3R_CCLIN3_OFF_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) OFF Position  */
#define PPS_CCLIN3R_Msk                       _UINT32_(0x0000000F)                                 /* (PPS_CCLIN3R) Register Mask  */


/* -------- PPS_CCLIN4R : (PPS Offset: 0xA8) (R/W 32)  -------- */
#define PPS_CCLIN4R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_CCLIN4R)   Reset Value */

