Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/include/component/pps.h
#define PPS_TC6WO0G3R_TC6WO0_Pos              _UINT32_(0)                                          /* (PPS_TC6WO0G3R) TC6/WO0G3 Position */
#define PPS_TC6WO0G3R_TC6WO0_Msk              (_UINT32_(0xF) << PPS_TC6WO0G3R_TC6WO0_Pos)          /* (PPS_TC6WO0G3R) TC6/WO0G3 Mask */
#define PPS_TC6WO0G3R_TC6WO0(value)           (PPS_TC6WO0G3R_TC6WO0_Msk & (_UINT32_(value) << PPS_TC6WO0G3R_TC6WO0_Pos)) /* Assigment of value for TC6WO0 in the PPS_TC6WO0G3R register */
#define   PPS_TC6WO0G3R_TC6WO0_RPA1_Val       _UINT32_(0xF)                                        /* (PPS_TC6WO0G3R) RPA1  */
#define   PPS_TC6WO0G3R_TC6WO0_RPA5_Val       _UINT32_(0x1)                                        /* (PPS_TC6WO0G3R) RPA5  */
#define   PPS_TC6WO0G3R_TC6WO0_RPA9_Val       _UINT32_(0x2)                                        /* (PPS_TC6WO0G3R) RPA9  */
#define   PPS_TC6WO0G3R_TC6WO0_RPA13_Val      _UINT32_(0x3)                                        /* (PPS_TC6WO0G3R) RPA13  */
#define   PPS_TC6WO0G3R_TC6WO0_RPB2_Val       _UINT32_(0x4)                                        /* (PPS_TC6WO0G3R) RPB2  */
#define   PPS_TC6WO0G3R_TC6WO0_RPB6_Val       _UINT32_(0x5)                                        /* (PPS_TC6WO0G3R) RPB6  */
#define   PPS_TC6WO0G3R_TC6WO0_RPB10_Val      _UINT32_(0x6)                                        /* (PPS_TC6WO0G3R) RPB10  */
#define   PPS_TC6WO0G3R_TC6WO0_RPA0_Val       _UINT32_(0x7)                                        /* (PPS_TC6WO0G3R) RPA0  */
#define   PPS_TC6WO0G3R_TC6WO0_RPA4_Val       _UINT32_(0x8)                                        /* (PPS_TC6WO0G3R) RPA4  */
#define   PPS_TC6WO0G3R_TC6WO0_RPA8_Val       _UINT32_(0x9)                                        /* (PPS_TC6WO0G3R) RPA8  */
#define   PPS_TC6WO0G3R_TC6WO0_RPA12_Val      _UINT32_(0xA)                                        /* (PPS_TC6WO0G3R) RPA12  */
#define   PPS_TC6WO0G3R_TC6WO0_RPB1_Val       _UINT32_(0xB)                                        /* (PPS_TC6WO0G3R) RPB1  */
#define   PPS_TC6WO0G3R_TC6WO0_RPB5_Val       _UINT32_(0xC)                                        /* (PPS_TC6WO0G3R) RPB5  */
#define   PPS_TC6WO0G3R_TC6WO0_RPB9_Val       _UINT32_(0xD)                                        /* (PPS_TC6WO0G3R) RPB9  */
#define   PPS_TC6WO0G3R_TC6WO0_RPB13_Val      _UINT32_(0xE)                                        /* (PPS_TC6WO0G3R) RPB13  */
#define   PPS_TC6WO0G3R_TC6WO0_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC6WO0G3R) OFF  */
#define PPS_TC6WO0G3R_TC6WO0_RPA1             (PPS_TC6WO0G3R_TC6WO0_RPA1_Val << PPS_TC6WO0G3R_TC6WO0_Pos) /* (PPS_TC6WO0G3R) RPA1 Position  */
#define PPS_TC6WO0G3R_TC6WO0_RPA5             (PPS_TC6WO0G3R_TC6WO0_RPA5_Val << PPS_TC6WO0G3R_TC6WO0_Pos) /* (PPS_TC6WO0G3R) RPA5 Position  */
#define PPS_TC6WO0G3R_TC6WO0_RPA9             (PPS_TC6WO0G3R_TC6WO0_RPA9_Val << PPS_TC6WO0G3R_TC6WO0_Pos) /* (PPS_TC6WO0G3R) RPA9 Position  */
#define PPS_TC6WO0G3R_TC6WO0_RPA13            (PPS_TC6WO0G3R_TC6WO0_RPA13_Val << PPS_TC6WO0G3R_TC6WO0_Pos) /* (PPS_TC6WO0G3R) RPA13 Position  */
#define PPS_TC6WO0G3R_TC6WO0_RPB2             (PPS_TC6WO0G3R_TC6WO0_RPB2_Val << PPS_TC6WO0G3R_TC6WO0_Pos) /* (PPS_TC6WO0G3R) RPB2 Position  */
#define PPS_TC6WO0G3R_TC6WO0_RPB6             (PPS_TC6WO0G3R_TC6WO0_RPB6_Val << PPS_TC6WO0G3R_TC6WO0_Pos) /* (PPS_TC6WO0G3R) RPB6 Position  */
#define PPS_TC6WO0G3R_TC6WO0_RPB10            (PPS_TC6WO0G3R_TC6WO0_RPB10_Val << PPS_TC6WO0G3R_TC6WO0_Pos) /* (PPS_TC6WO0G3R) RPB10 Position  */
#define PPS_TC6WO0G3R_TC6WO0_RPA0             (PPS_TC6WO0G3R_TC6WO0_RPA0_Val << PPS_TC6WO0G3R_TC6WO0_Pos) /* (PPS_TC6WO0G3R) RPA0 Position  */
#define PPS_TC6WO0G3R_TC6WO0_RPA4             (PPS_TC6WO0G3R_TC6WO0_RPA4_Val << PPS_TC6WO0G3R_TC6WO0_Pos) /* (PPS_TC6WO0G3R) RPA4 Position  */
#define PPS_TC6WO0G3R_TC6WO0_RPA8             (PPS_TC6WO0G3R_TC6WO0_RPA8_Val << PPS_TC6WO0G3R_TC6WO0_Pos) /* (PPS_TC6WO0G3R) RPA8 Position  */
#define PPS_TC6WO0G3R_TC6WO0_RPA12            (PPS_TC6WO0G3R_TC6WO0_RPA12_Val << PPS_TC6WO0G3R_TC6WO0_Pos) /* (PPS_TC6WO0G3R) RPA12 Position  */
#define PPS_TC6WO0G3R_TC6WO0_RPB1             (PPS_TC6WO0G3R_TC6WO0_RPB1_Val << PPS_TC6WO0G3R_TC6WO0_Pos) /* (PPS_TC6WO0G3R) RPB1 Position  */
#define PPS_TC6WO0G3R_TC6WO0_RPB5             (PPS_TC6WO0G3R_TC6WO0_RPB5_Val << PPS_TC6WO0G3R_TC6WO0_Pos) /* (PPS_TC6WO0G3R) RPB5 Position  */
#define PPS_TC6WO0G3R_TC6WO0_RPB9             (PPS_TC6WO0G3R_TC6WO0_RPB9_Val << PPS_TC6WO0G3R_TC6WO0_Pos) /* (PPS_TC6WO0G3R) RPB9 Position  */
#define PPS_TC6WO0G3R_TC6WO0_RPB13            (PPS_TC6WO0G3R_TC6WO0_RPB13_Val << PPS_TC6WO0G3R_TC6WO0_Pos) /* (PPS_TC6WO0G3R) RPB13 Position  */
#define PPS_TC6WO0G3R_TC6WO0_OFF              (PPS_TC6WO0G3R_TC6WO0_OFF_Val << PPS_TC6WO0G3R_TC6WO0_Pos) /* (PPS_TC6WO0G3R) OFF Position  */
#define PPS_TC6WO0G3R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC6WO0G3R) Register Mask  */


/* -------- PPS_TC6WO1G2R : (PPS Offset: 0x110) (R/W 32)  -------- */
#define PPS_TC6WO1G2R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC6WO1G2R)   Reset Value */

#define PPS_TC6WO1G2R_TC6WO1_Pos              _UINT32_(0)                                          /* (PPS_TC6WO1G2R) TC6/WO1G2 Position */
#define PPS_TC6WO1G2R_TC6WO1_Msk              (_UINT32_(0xF) << PPS_TC6WO1G2R_TC6WO1_Pos)          /* (PPS_TC6WO1G2R) TC6/WO1G2 Mask */
#define PPS_TC6WO1G2R_TC6WO1(value)           (PPS_TC6WO1G2R_TC6WO1_Msk & (_UINT32_(value) << PPS_TC6WO1G2R_TC6WO1_Pos)) /* Assigment of value for TC6WO1 in the PPS_TC6WO1G2R register */
#define   PPS_TC6WO1G2R_TC6WO1_RPA0_Val       _UINT32_(0xF)                                        /* (PPS_TC6WO1G2R) RPA0  */
#define   PPS_TC6WO1G2R_TC6WO1_RPA4_Val       _UINT32_(0x1)                                        /* (PPS_TC6WO1G2R) RPA4  */
#define   PPS_TC6WO1G2R_TC6WO1_RPA8_Val       _UINT32_(0x2)                                        /* (PPS_TC6WO1G2R) RPA8  */
#define   PPS_TC6WO1G2R_TC6WO1_RPA12_Val      _UINT32_(0x3)                                        /* (PPS_TC6WO1G2R) RPA12  */
#define   PPS_TC6WO1G2R_TC6WO1_RPB1_Val       _UINT32_(0x4)                                        /* (PPS_TC6WO1G2R) RPB1  */
#define   PPS_TC6WO1G2R_TC6WO1_RPB5_Val       _UINT32_(0x5)                                        /* (PPS_TC6WO1G2R) RPB5  */
#define   PPS_TC6WO1G2R_TC6WO1_RPB9_Val       _UINT32_(0x6)                                        /* (PPS_TC6WO1G2R) RPB9  */
#define   PPS_TC6WO1G2R_TC6WO1_RPB13_Val      _UINT32_(0x7)                                        /* (PPS_TC6WO1G2R) RPB13  */
#define   PPS_TC6WO1G2R_TC6WO1_RPA3_Val       _UINT32_(0x8)                                        /* (PPS_TC6WO1G2R) RPA3  */
#define   PPS_TC6WO1G2R_TC6WO1_RPA7_Val       _UINT32_(0x9)                                        /* (PPS_TC6WO1G2R) RPA7  */
#define   PPS_TC6WO1G2R_TC6WO1_RPA11_Val      _UINT32_(0xA)                                        /* (PPS_TC6WO1G2R) RPA11  */
#define   PPS_TC6WO1G2R_TC6WO1_RPB0_Val       _UINT32_(0xB)                                        /* (PPS_TC6WO1G2R) RPB0  */
#define   PPS_TC6WO1G2R_TC6WO1_RPB4_Val       _UINT32_(0xC)                                        /* (PPS_TC6WO1G2R) RPB4  */
#define   PPS_TC6WO1G2R_TC6WO1_RPB8_Val       _UINT32_(0xD)                                        /* (PPS_TC6WO1G2R) RPB8  */
#define   PPS_TC6WO1G2R_TC6WO1_RPB12_Val      _UINT32_(0xE)                                        /* (PPS_TC6WO1G2R) RPB12  */
#define   PPS_TC6WO1G2R_TC6WO1_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC6WO1G2R) OFF  */
#define PPS_TC6WO1G2R_TC6WO1_RPA0             (PPS_TC6WO1G2R_TC6WO1_RPA0_Val << PPS_TC6WO1G2R_TC6WO1_Pos) /* (PPS_TC6WO1G2R) RPA0 Position  */
#define PPS_TC6WO1G2R_TC6WO1_RPA4             (PPS_TC6WO1G2R_TC6WO1_RPA4_Val << PPS_TC6WO1G2R_TC6WO1_Pos) /* (PPS_TC6WO1G2R) RPA4 Position  */
#define PPS_TC6WO1G2R_TC6WO1_RPA8             (PPS_TC6WO1G2R_TC6WO1_RPA8_Val << PPS_TC6WO1G2R_TC6WO1_Pos) /* (PPS_TC6WO1G2R) RPA8 Position  */
#define PPS_TC6WO1G2R_TC6WO1_RPA12            (PPS_TC6WO1G2R_TC6WO1_RPA12_Val << PPS_TC6WO1G2R_TC6WO1_Pos) /* (PPS_TC6WO1G2R) RPA12 Position  */
#define PPS_TC6WO1G2R_TC6WO1_RPB1             (PPS_TC6WO1G2R_TC6WO1_RPB1_Val << PPS_TC6WO1G2R_TC6WO1_Pos) /* (PPS_TC6WO1G2R) RPB1 Position  */
#define PPS_TC6WO1G2R_TC6WO1_RPB5             (PPS_TC6WO1G2R_TC6WO1_RPB5_Val << PPS_TC6WO1G2R_TC6WO1_Pos) /* (PPS_TC6WO1G2R) RPB5 Position  */
#define PPS_TC6WO1G2R_TC6WO1_RPB9             (PPS_TC6WO1G2R_TC6WO1_RPB9_Val << PPS_TC6WO1G2R_TC6WO1_Pos) /* (PPS_TC6WO1G2R) RPB9 Position  */
#define PPS_TC6WO1G2R_TC6WO1_RPB13            (PPS_TC6WO1G2R_TC6WO1_RPB13_Val << PPS_TC6WO1G2R_TC6WO1_Pos) /* (PPS_TC6WO1G2R) RPB13 Position  */
#define PPS_TC6WO1G2R_TC6WO1_RPA3             (PPS_TC6WO1G2R_TC6WO1_RPA3_Val << PPS_TC6WO1G2R_TC6WO1_Pos) /* (PPS_TC6WO1G2R) RPA3 Position  */
#define PPS_TC6WO1G2R_TC6WO1_RPA7             (PPS_TC6WO1G2R_TC6WO1_RPA7_Val << PPS_TC6WO1G2R_TC6WO1_Pos) /* (PPS_TC6WO1G2R) RPA7 Position  */
#define PPS_TC6WO1G2R_TC6WO1_RPA11            (PPS_TC6WO1G2R_TC6WO1_RPA11_Val << PPS_TC6WO1G2R_TC6WO1_Pos) /* (PPS_TC6WO1G2R) RPA11 Position  */
#define PPS_TC6WO1G2R_TC6WO1_RPB0             (PPS_TC6WO1G2R_TC6WO1_RPB0_Val << PPS_TC6WO1G2R_TC6WO1_Pos) /* (PPS_TC6WO1G2R) RPB0 Position  */
#define PPS_TC6WO1G2R_TC6WO1_RPB4             (PPS_TC6WO1G2R_TC6WO1_RPB4_Val << PPS_TC6WO1G2R_TC6WO1_Pos) /* (PPS_TC6WO1G2R) RPB4 Position  */
#define PPS_TC6WO1G2R_TC6WO1_RPB8             (PPS_TC6WO1G2R_TC6WO1_RPB8_Val << PPS_TC6WO1G2R_TC6WO1_Pos) /* (PPS_TC6WO1G2R) RPB8 Position  */
#define PPS_TC6WO1G2R_TC6WO1_RPB12            (PPS_TC6WO1G2R_TC6WO1_RPB12_Val << PPS_TC6WO1G2R_TC6WO1_Pos) /* (PPS_TC6WO1G2R) RPB12 Position  */
#define PPS_TC6WO1G2R_TC6WO1_OFF              (PPS_TC6WO1G2R_TC6WO1_OFF_Val << PPS_TC6WO1G2R_TC6WO1_Pos) /* (PPS_TC6WO1G2R) OFF Position  */
#define PPS_TC6WO1G2R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC6WO1G2R) Register Mask  */


