Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/include/component/pps.h
#define PPS_RPB7G4R_RPB7G4R_Pos               _UINT32_(0)                                          /* (PPS_RPB7G4R) RPB7/G4 Position */
#define PPS_RPB7G4R_RPB7G4R_Msk               (_UINT32_(0x1F) << PPS_RPB7G4R_RPB7G4R_Pos)          /* (PPS_RPB7G4R) RPB7/G4 Mask */
#define PPS_RPB7G4R_RPB7G4R(value)            (PPS_RPB7G4R_RPB7G4R_Msk & (_UINT32_(value) << PPS_RPB7G4R_RPB7G4R_Pos)) /* Assigment of value for RPB7G4R in the PPS_RPB7G4R register */
#define   PPS_RPB7G4R_RPB7G4R_OFF_Val         _UINT32_(0x0)                                        /* (PPS_RPB7G4R) OFF  */
#define   PPS_RPB7G4R_RPB7G4R_SCOM0P2_Val     _UINT32_(0x1)                                        /* (PPS_RPB7G4R) SERCOM0/PAD2  */
#define   PPS_RPB7G4R_RPB7G4R_SCOM0P0_Val     _UINT32_(0x3)                                        /* (PPS_RPB7G4R) SERCOM0/PAD0  */
#define   PPS_RPB7G4R_RPB7G4R_SCOM1P3_Val     _UINT32_(0x4)                                        /* (PPS_RPB7G4R) SERCOM1/PAD3  */
#define   PPS_RPB7G4R_RPB7G4R_SCOM1P0_Val     _UINT32_(0x6)                                        /* (PPS_RPB7G4R) SERCOM1/PAD0  */
#define   PPS_RPB7G4R_RPB7G4R_TCC0WO3_Val     _UINT32_(0x7)                                        /* (PPS_RPB7G4R) TCC0/WO3  */
#define   PPS_RPB7G4R_RPB7G4R_TCC0WO1_Val     _UINT32_(0x8)                                        /* (PPS_RPB7G4R) TCC0/WO1  */
#define   PPS_RPB7G4R_RPB7G4R_TCC0WO5_Val     _UINT32_(0x9)                                        /* (PPS_RPB7G4R) TCC0/WO5  */
#define   PPS_RPB7G4R_RPB7G4R_TCC1WO3_Val     _UINT32_(0xA)                                        /* (PPS_RPB7G4R) TCC1/WO3  */
#define   PPS_RPB7G4R_RPB7G4R_TCC1WO1_Val     _UINT32_(0xB)                                        /* (PPS_RPB7G4R) TCC1/WO1  */
#define   PPS_RPB7G4R_RPB7G4R_TCC1WO5_Val     _UINT32_(0xC)                                        /* (PPS_RPB7G4R) TCC1/WO5  */
#define   PPS_RPB7G4R_RPB7G4R_TCC2WO1_Val     _UINT32_(0xD)                                        /* (PPS_RPB7G4R) TCC2/WO1  */
#define   PPS_RPB7G4R_RPB7G4R_TC0WO0_Val      _UINT32_(0xF)                                        /* (PPS_RPB7G4R) TC0/WO0  */
#define   PPS_RPB7G4R_RPB7G4R_TC1WO1_Val      _UINT32_(0x10)                                       /* (PPS_RPB7G4R) TC1/WO1  */
#define   PPS_RPB7G4R_RPB7G4R_TC2WO1_Val      _UINT32_(0x11)                                       /* (PPS_RPB7G4R) TC2/WO1  */
#define   PPS_RPB7G4R_RPB7G4R_TC3WO1_Val      _UINT32_(0x12)                                       /* (PPS_RPB7G4R) TC3/WO1  */
#define   PPS_RPB7G4R_RPB7G4R_TC4WO1_Val      _UINT32_(0x13)                                       /* (PPS_RPB7G4R) TC4/WO1  */
#define   PPS_RPB7G4R_RPB7G4R_TC5WO1_Val      _UINT32_(0x14)                                       /* (PPS_RPB7G4R) TC5/WO1  */
#define   PPS_RPB7G4R_RPB7G4R_TC6WO1_Val      _UINT32_(0x15)                                       /* (PPS_RPB7G4R) TC6/WO1  */
#define   PPS_RPB7G4R_RPB7G4R_TC7WO1_Val      _UINT32_(0x16)                                       /* (PPS_RPB7G4R) TC7/WO1  */
#define   PPS_RPB7G4R_RPB7G4R_QCS_Val         _UINT32_(0x17)                                       /* (PPS_RPB7G4R) QCS  */
#define   PPS_RPB7G4R_RPB7G4R_QD2_Val         _UINT32_(0x18)                                       /* (PPS_RPB7G4R) QD2  */
#define   PPS_RPB7G4R_RPB7G4R_QD1_Val         _UINT32_(0x19)                                       /* (PPS_RPB7G4R) QD1  */
#define   PPS_RPB7G4R_RPB7G4R_QD0_Val         _UINT32_(0x1A)                                       /* (PPS_RPB7G4R) QD0  */
#define   PPS_RPB7G4R_RPB7G4R_CCLOUT1_Val     _UINT32_(0x1B)                                       /* (PPS_RPB7G4R) CCLOUT1  */
#define   PPS_RPB7G4R_RPB7G4R_TSTBUS2_Val     _UINT32_(0x1C)                                       /* (PPS_RPB7G4R) TSTBUS2  */
#define   PPS_RPB7G4R_RPB7G4R_TSTBUS5_Val     _UINT32_(0x1D)                                       /* (PPS_RPB7G4R) TSTBUS5  */
#define   PPS_RPB7G4R_RPB7G4R_TSTBUS8_Val     _UINT32_(0x1E)                                       /* (PPS_RPB7G4R) TSTBUS8  */
#define   PPS_RPB7G4R_RPB7G4R_TSTBUS11_Val    _UINT32_(0x1F)                                       /* (PPS_RPB7G4R) TSTBUS11  */
#define PPS_RPB7G4R_RPB7G4R_OFF               (PPS_RPB7G4R_RPB7G4R_OFF_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) OFF Position  */
#define PPS_RPB7G4R_RPB7G4R_SCOM0P2           (PPS_RPB7G4R_RPB7G4R_SCOM0P2_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) SERCOM0/PAD2 Position  */
#define PPS_RPB7G4R_RPB7G4R_SCOM0P0           (PPS_RPB7G4R_RPB7G4R_SCOM0P0_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) SERCOM0/PAD0 Position  */
#define PPS_RPB7G4R_RPB7G4R_SCOM1P3           (PPS_RPB7G4R_RPB7G4R_SCOM1P3_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) SERCOM1/PAD3 Position  */
#define PPS_RPB7G4R_RPB7G4R_SCOM1P0           (PPS_RPB7G4R_RPB7G4R_SCOM1P0_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) SERCOM1/PAD0 Position  */
#define PPS_RPB7G4R_RPB7G4R_TCC0WO3           (PPS_RPB7G4R_RPB7G4R_TCC0WO3_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TCC0/WO3 Position  */
#define PPS_RPB7G4R_RPB7G4R_TCC0WO1           (PPS_RPB7G4R_RPB7G4R_TCC0WO1_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TCC0/WO1 Position  */
#define PPS_RPB7G4R_RPB7G4R_TCC0WO5           (PPS_RPB7G4R_RPB7G4R_TCC0WO5_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TCC0/WO5 Position  */
#define PPS_RPB7G4R_RPB7G4R_TCC1WO3           (PPS_RPB7G4R_RPB7G4R_TCC1WO3_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TCC1/WO3 Position  */
#define PPS_RPB7G4R_RPB7G4R_TCC1WO1           (PPS_RPB7G4R_RPB7G4R_TCC1WO1_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TCC1/WO1 Position  */
#define PPS_RPB7G4R_RPB7G4R_TCC1WO5           (PPS_RPB7G4R_RPB7G4R_TCC1WO5_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TCC1/WO5 Position  */
#define PPS_RPB7G4R_RPB7G4R_TCC2WO1           (PPS_RPB7G4R_RPB7G4R_TCC2WO1_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TCC2/WO1 Position  */
#define PPS_RPB7G4R_RPB7G4R_TC0WO0            (PPS_RPB7G4R_RPB7G4R_TC0WO0_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TC0/WO0 Position  */
#define PPS_RPB7G4R_RPB7G4R_TC1WO1            (PPS_RPB7G4R_RPB7G4R_TC1WO1_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TC1/WO1 Position  */
#define PPS_RPB7G4R_RPB7G4R_TC2WO1            (PPS_RPB7G4R_RPB7G4R_TC2WO1_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TC2/WO1 Position  */
#define PPS_RPB7G4R_RPB7G4R_TC3WO1            (PPS_RPB7G4R_RPB7G4R_TC3WO1_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TC3/WO1 Position  */
#define PPS_RPB7G4R_RPB7G4R_TC4WO1            (PPS_RPB7G4R_RPB7G4R_TC4WO1_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TC4/WO1 Position  */
#define PPS_RPB7G4R_RPB7G4R_TC5WO1            (PPS_RPB7G4R_RPB7G4R_TC5WO1_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TC5/WO1 Position  */
#define PPS_RPB7G4R_RPB7G4R_TC6WO1            (PPS_RPB7G4R_RPB7G4R_TC6WO1_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TC6/WO1 Position  */
#define PPS_RPB7G4R_RPB7G4R_TC7WO1            (PPS_RPB7G4R_RPB7G4R_TC7WO1_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TC7/WO1 Position  */
#define PPS_RPB7G4R_RPB7G4R_QCS               (PPS_RPB7G4R_RPB7G4R_QCS_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) QCS Position  */
#define PPS_RPB7G4R_RPB7G4R_QD2               (PPS_RPB7G4R_RPB7G4R_QD2_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) QD2 Position  */
#define PPS_RPB7G4R_RPB7G4R_QD1               (PPS_RPB7G4R_RPB7G4R_QD1_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) QD1 Position  */
#define PPS_RPB7G4R_RPB7G4R_QD0               (PPS_RPB7G4R_RPB7G4R_QD0_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) QD0 Position  */
#define PPS_RPB7G4R_RPB7G4R_CCLOUT1           (PPS_RPB7G4R_RPB7G4R_CCLOUT1_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) CCLOUT1 Position  */
#define PPS_RPB7G4R_RPB7G4R_TSTBUS2           (PPS_RPB7G4R_RPB7G4R_TSTBUS2_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TSTBUS2 Position  */
#define PPS_RPB7G4R_RPB7G4R_TSTBUS5           (PPS_RPB7G4R_RPB7G4R_TSTBUS5_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TSTBUS5 Position  */
#define PPS_RPB7G4R_RPB7G4R_TSTBUS8           (PPS_RPB7G4R_RPB7G4R_TSTBUS8_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TSTBUS8 Position  */
#define PPS_RPB7G4R_RPB7G4R_TSTBUS11          (PPS_RPB7G4R_RPB7G4R_TSTBUS11_Val << PPS_RPB7G4R_RPB7G4R_Pos) /* (PPS_RPB7G4R) TSTBUS11 Position  */
#define PPS_RPB7G4R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_RPB7G4R) Register Mask  */


/* -------- PPS_RPB8G1R : (PPS Offset: 0x2CC) (R/W 32)  -------- */
#define PPS_RPB8G1R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPB8G1R)   Reset Value */

#define PPS_RPB8G1R_RPB8G1R_Pos               _UINT32_(0)                                          /* (PPS_RPB8G1R) RPB8/G1 Position */
#define PPS_RPB8G1R_RPB8G1R_Msk               (_UINT32_(0x1F) << PPS_RPB8G1R_RPB8G1R_Pos)          /* (PPS_RPB8G1R) RPB8/G1 Mask */
#define PPS_RPB8G1R_RPB8G1R(value)            (PPS_RPB8G1R_RPB8G1R_Msk & (_UINT32_(value) << PPS_RPB8G1R_RPB8G1R_Pos)) /* Assigment of value for RPB8G1R in the PPS_RPB8G1R register */
#define   PPS_RPB8G1R_RPB8G1R_OFF_Val         _UINT32_(0x0)                                        /* (PPS_RPB8G1R) OFF  */
#define   PPS_RPB8G1R_RPB8G1R_SCOM0P1_Val     _UINT32_(0x1)                                        /* (PPS_RPB8G1R) SERCOM0/PAD1  */
#define   PPS_RPB8G1R_RPB8G1R_SCOM1P1_Val     _UINT32_(0x2)                                        /* (PPS_RPB8G1R) SERCOM1/PAD1  */
#define   PPS_RPB8G1R_RPB8G1R_REFO1_Val       _UINT32_(0x3)                                        /* (PPS_RPB8G1R) REFO1  */
#define   PPS_RPB8G1R_RPB8G1R_REFO2_Val       _UINT32_(0x4)                                        /* (PPS_RPB8G1R) REFO2  */
#define   PPS_RPB8G1R_RPB8G1R_REFO3_Val       _UINT32_(0x5)                                        /* (PPS_RPB8G1R) REFO3  */
#define   PPS_RPB8G1R_RPB8G1R_REFO4_Val       _UINT32_(0x6)                                        /* (PPS_RPB8G1R) REFO4  */
#define   PPS_RPB8G1R_RPB8G1R_QSCK_Val        _UINT32_(0x7)                                        /* (PPS_RPB8G1R) QSCK  */
#define PPS_RPB8G1R_RPB8G1R_OFF               (PPS_RPB8G1R_RPB8G1R_OFF_Val << PPS_RPB8G1R_RPB8G1R_Pos) /* (PPS_RPB8G1R) OFF Position  */
#define PPS_RPB8G1R_RPB8G1R_SCOM0P1           (PPS_RPB8G1R_RPB8G1R_SCOM0P1_Val << PPS_RPB8G1R_RPB8G1R_Pos) /* (PPS_RPB8G1R) SERCOM0/PAD1 Position  */
#define PPS_RPB8G1R_RPB8G1R_SCOM1P1           (PPS_RPB8G1R_RPB8G1R_SCOM1P1_Val << PPS_RPB8G1R_RPB8G1R_Pos) /* (PPS_RPB8G1R) SERCOM1/PAD1 Position  */
#define PPS_RPB8G1R_RPB8G1R_REFO1             (PPS_RPB8G1R_RPB8G1R_REFO1_Val << PPS_RPB8G1R_RPB8G1R_Pos) /* (PPS_RPB8G1R) REFO1 Position  */
#define PPS_RPB8G1R_RPB8G1R_REFO2             (PPS_RPB8G1R_RPB8G1R_REFO2_Val << PPS_RPB8G1R_RPB8G1R_Pos) /* (PPS_RPB8G1R) REFO2 Position  */
#define PPS_RPB8G1R_RPB8G1R_REFO3             (PPS_RPB8G1R_RPB8G1R_REFO3_Val << PPS_RPB8G1R_RPB8G1R_Pos) /* (PPS_RPB8G1R) REFO3 Position  */
#define PPS_RPB8G1R_RPB8G1R_REFO4             (PPS_RPB8G1R_RPB8G1R_REFO4_Val << PPS_RPB8G1R_RPB8G1R_Pos) /* (PPS_RPB8G1R) REFO4 Position  */
#define PPS_RPB8G1R_RPB8G1R_QSCK              (PPS_RPB8G1R_RPB8G1R_QSCK_Val << PPS_RPB8G1R_RPB8G1R_Pos) /* (PPS_RPB8G1R) QSCK Position  */
#define PPS_RPB8G1R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_RPB8G1R) Register Mask  */


