Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/include/component/pps.h
/* -------- PPS_RPB8G2R : (PPS Offset: 0x2D0) (R/W 32)  -------- */
#define PPS_RPB8G2R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPB8G2R)   Reset Value */

#define PPS_RPB8G2R_RPB8G2R_Pos               _UINT32_(0)                                          /* (PPS_RPB8G2R) RPB8/G2 Position */
#define PPS_RPB8G2R_RPB8G2R_Msk               (_UINT32_(0x1F) << PPS_RPB8G2R_RPB8G2R_Pos)          /* (PPS_RPB8G2R) RPB8/G2 Mask */
#define PPS_RPB8G2R_RPB8G2R(value)            (PPS_RPB8G2R_RPB8G2R_Msk & (_UINT32_(value) << PPS_RPB8G2R_RPB8G2R_Pos)) /* Assigment of value for RPB8G2R in the PPS_RPB8G2R register */
#define   PPS_RPB8G2R_RPB8G2R_OFF_Val         _UINT32_(0x0)                                        /* (PPS_RPB8G2R) OFF  */
#define   PPS_RPB8G2R_RPB8G2R_SCOM0P0_Val     _UINT32_(0x1)                                        /* (PPS_RPB8G2R) SERCOM0/PAD0  */
#define   PPS_RPB8G2R_RPB8G2R_SCOM0P3_Val     _UINT32_(0x2)                                        /* (PPS_RPB8G2R) SERCOM0/PAD3  */
#define   PPS_RPB8G2R_RPB8G2R_SCOM0P2_Val     _UINT32_(0x3)                                        /* (PPS_RPB8G2R) SERCOM0/PAD2  */
#define   PPS_RPB8G2R_RPB8G2R_SCOM1P3_Val     _UINT32_(0x5)                                        /* (PPS_RPB8G2R) SERCOM1/PAD3  */
#define   PPS_RPB8G2R_RPB8G2R_SCOM1P2_Val     _UINT32_(0x6)                                        /* (PPS_RPB8G2R) SERCOM1/PAD2  */
#define   PPS_RPB8G2R_RPB8G2R_TCC0WO1_Val     _UINT32_(0x7)                                        /* (PPS_RPB8G2R) TCC0/WO1  */
#define   PPS_RPB8G2R_RPB8G2R_TCC0WO5_Val     _UINT32_(0x8)                                        /* (PPS_RPB8G2R) TCC0/WO5  */
#define   PPS_RPB8G2R_RPB8G2R_TCC0WO3_Val     _UINT32_(0x9)                                        /* (PPS_RPB8G2R) TCC0/WO3  */
#define   PPS_RPB8G2R_RPB8G2R_TCC1WO1_Val     _UINT32_(0xA)                                        /* (PPS_RPB8G2R) TCC1/WO1  */
#define   PPS_RPB8G2R_RPB8G2R_TCC1WO5_Val     _UINT32_(0xB)                                        /* (PPS_RPB8G2R) TCC1/WO5  */
#define   PPS_RPB8G2R_RPB8G2R_TCC1WO3_Val     _UINT32_(0xC)                                        /* (PPS_RPB8G2R) TCC1/WO3  */
#define   PPS_RPB8G2R_RPB8G2R_TCC2WO1_Val     _UINT32_(0xD)                                        /* (PPS_RPB8G2R) TCC2/WO1  */
#define   PPS_RPB8G2R_RPB8G2R_TC0WO1_Val      _UINT32_(0xF)                                        /* (PPS_RPB8G2R) TC0/WO1  */
#define   PPS_RPB8G2R_RPB8G2R_TC1WO1_Val      _UINT32_(0x10)                                       /* (PPS_RPB8G2R) TC1/WO1  */
#define   PPS_RPB8G2R_RPB8G2R_TC2WO1_Val      _UINT32_(0x11)                                       /* (PPS_RPB8G2R) TC2/WO1  */
#define   PPS_RPB8G2R_RPB8G2R_TC3WO1_Val      _UINT32_(0x12)                                       /* (PPS_RPB8G2R) TC3/WO1  */
#define   PPS_RPB8G2R_RPB8G2R_TC4WO1_Val      _UINT32_(0x13)                                       /* (PPS_RPB8G2R) TC4/WO1  */
#define   PPS_RPB8G2R_RPB8G2R_TC5WO1_Val      _UINT32_(0x14)                                       /* (PPS_RPB8G2R) TC5/WO1  */
#define   PPS_RPB8G2R_RPB8G2R_TC6WO1_Val      _UINT32_(0x15)                                       /* (PPS_RPB8G2R) TC6/WO1  */
#define   PPS_RPB8G2R_RPB8G2R_TC7WO1_Val      _UINT32_(0x16)                                       /* (PPS_RPB8G2R) TC7/WO1  */
#define   PPS_RPB8G2R_RPB8G2R_QSPICS_Val      _UINT32_(0x17)                                       /* (PPS_RPB8G2R) QSPI/CS  */
#define   PPS_RPB8G2R_RPB8G2R_QD0_Val         _UINT32_(0x18)                                       /* (PPS_RPB8G2R) QD0  */
#define   PPS_RPB8G2R_RPB8G2R_QD3_Val         _UINT32_(0x19)                                       /* (PPS_RPB8G2R) QD3  */
#define   PPS_RPB8G2R_RPB8G2R_QD2_Val         _UINT32_(0x1A)                                       /* (PPS_RPB8G2R) QD2  */
#define   PPS_RPB8G2R_RPB8G2R_CCLOUT1_Val     _UINT32_(0x1B)                                       /* (PPS_RPB8G2R) CCLOUT1  */
#define   PPS_RPB8G2R_RPB8G2R_TSTBUS0_Val     _UINT32_(0x1C)                                       /* (PPS_RPB8G2R) TSTBUS0  */
#define   PPS_RPB8G2R_RPB8G2R_TSTBUS3_Val     _UINT32_(0x1D)                                       /* (PPS_RPB8G2R) TSTBUS3  */
#define   PPS_RPB8G2R_RPB8G2R_TSTBUS6_Val     _UINT32_(0x1E)                                       /* (PPS_RPB8G2R) TSTBUS6  */
#define   PPS_RPB8G2R_RPB8G2R_TSTBUS9_Val     _UINT32_(0x1F)                                       /* (PPS_RPB8G2R) TSTBUS9  */
#define PPS_RPB8G2R_RPB8G2R_OFF               (PPS_RPB8G2R_RPB8G2R_OFF_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) OFF Position  */
#define PPS_RPB8G2R_RPB8G2R_SCOM0P0           (PPS_RPB8G2R_RPB8G2R_SCOM0P0_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) SERCOM0/PAD0 Position  */
#define PPS_RPB8G2R_RPB8G2R_SCOM0P3           (PPS_RPB8G2R_RPB8G2R_SCOM0P3_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) SERCOM0/PAD3 Position  */
#define PPS_RPB8G2R_RPB8G2R_SCOM0P2           (PPS_RPB8G2R_RPB8G2R_SCOM0P2_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) SERCOM0/PAD2 Position  */
#define PPS_RPB8G2R_RPB8G2R_SCOM1P3           (PPS_RPB8G2R_RPB8G2R_SCOM1P3_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) SERCOM1/PAD3 Position  */
#define PPS_RPB8G2R_RPB8G2R_SCOM1P2           (PPS_RPB8G2R_RPB8G2R_SCOM1P2_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) SERCOM1/PAD2 Position  */
#define PPS_RPB8G2R_RPB8G2R_TCC0WO1           (PPS_RPB8G2R_RPB8G2R_TCC0WO1_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TCC0/WO1 Position  */
#define PPS_RPB8G2R_RPB8G2R_TCC0WO5           (PPS_RPB8G2R_RPB8G2R_TCC0WO5_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TCC0/WO5 Position  */
#define PPS_RPB8G2R_RPB8G2R_TCC0WO3           (PPS_RPB8G2R_RPB8G2R_TCC0WO3_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TCC0/WO3 Position  */
#define PPS_RPB8G2R_RPB8G2R_TCC1WO1           (PPS_RPB8G2R_RPB8G2R_TCC1WO1_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TCC1/WO1 Position  */
#define PPS_RPB8G2R_RPB8G2R_TCC1WO5           (PPS_RPB8G2R_RPB8G2R_TCC1WO5_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TCC1/WO5 Position  */
#define PPS_RPB8G2R_RPB8G2R_TCC1WO3           (PPS_RPB8G2R_RPB8G2R_TCC1WO3_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TCC1/WO3 Position  */
#define PPS_RPB8G2R_RPB8G2R_TCC2WO1           (PPS_RPB8G2R_RPB8G2R_TCC2WO1_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TCC2/WO1 Position  */
#define PPS_RPB8G2R_RPB8G2R_TC0WO1            (PPS_RPB8G2R_RPB8G2R_TC0WO1_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TC0/WO1 Position  */
#define PPS_RPB8G2R_RPB8G2R_TC1WO1            (PPS_RPB8G2R_RPB8G2R_TC1WO1_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TC1/WO1 Position  */
#define PPS_RPB8G2R_RPB8G2R_TC2WO1            (PPS_RPB8G2R_RPB8G2R_TC2WO1_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TC2/WO1 Position  */
#define PPS_RPB8G2R_RPB8G2R_TC3WO1            (PPS_RPB8G2R_RPB8G2R_TC3WO1_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TC3/WO1 Position  */
#define PPS_RPB8G2R_RPB8G2R_TC4WO1            (PPS_RPB8G2R_RPB8G2R_TC4WO1_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TC4/WO1 Position  */
#define PPS_RPB8G2R_RPB8G2R_TC5WO1            (PPS_RPB8G2R_RPB8G2R_TC5WO1_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TC5/WO1 Position  */
#define PPS_RPB8G2R_RPB8G2R_TC6WO1            (PPS_RPB8G2R_RPB8G2R_TC6WO1_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TC6/WO1 Position  */
#define PPS_RPB8G2R_RPB8G2R_TC7WO1            (PPS_RPB8G2R_RPB8G2R_TC7WO1_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TC7/WO1 Position  */
#define PPS_RPB8G2R_RPB8G2R_QSPICS            (PPS_RPB8G2R_RPB8G2R_QSPICS_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) QSPI/CS Position  */
#define PPS_RPB8G2R_RPB8G2R_QD0               (PPS_RPB8G2R_RPB8G2R_QD0_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) QD0 Position  */
#define PPS_RPB8G2R_RPB8G2R_QD3               (PPS_RPB8G2R_RPB8G2R_QD3_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) QD3 Position  */
#define PPS_RPB8G2R_RPB8G2R_QD2               (PPS_RPB8G2R_RPB8G2R_QD2_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) QD2 Position  */
#define PPS_RPB8G2R_RPB8G2R_CCLOUT1           (PPS_RPB8G2R_RPB8G2R_CCLOUT1_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) CCLOUT1 Position  */
#define PPS_RPB8G2R_RPB8G2R_TSTBUS0           (PPS_RPB8G2R_RPB8G2R_TSTBUS0_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TSTBUS0 Position  */
#define PPS_RPB8G2R_RPB8G2R_TSTBUS3           (PPS_RPB8G2R_RPB8G2R_TSTBUS3_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TSTBUS3 Position  */
#define PPS_RPB8G2R_RPB8G2R_TSTBUS6           (PPS_RPB8G2R_RPB8G2R_TSTBUS6_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TSTBUS6 Position  */
#define PPS_RPB8G2R_RPB8G2R_TSTBUS9           (PPS_RPB8G2R_RPB8G2R_TSTBUS9_Val << PPS_RPB8G2R_RPB8G2R_Pos) /* (PPS_RPB8G2R) TSTBUS9 Position  */
#define PPS_RPB8G2R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_RPB8G2R) Register Mask  */


/* -------- PPS_RPB9G1R : (PPS Offset: 0x2D4) (R/W 32)  -------- */
#define PPS_RPB9G1R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPB9G1R)   Reset Value */

#define PPS_RPB9G1R_RPB9G1R_Pos               _UINT32_(0)                                          /* (PPS_RPB9G1R) RPB9/G1 Position */
#define PPS_RPB9G1R_RPB9G1R_Msk               (_UINT32_(0x1F) << PPS_RPB9G1R_RPB9G1R_Pos)          /* (PPS_RPB9G1R) RPB9/G1 Mask */
#define PPS_RPB9G1R_RPB9G1R(value)            (PPS_RPB9G1R_RPB9G1R_Msk & (_UINT32_(value) << PPS_RPB9G1R_RPB9G1R_Pos)) /* Assigment of value for RPB9G1R in the PPS_RPB9G1R register */
#define   PPS_RPB9G1R_RPB9G1R_OFF_Val         _UINT32_(0x0)                                        /* (PPS_RPB9G1R) OFF  */
#define   PPS_RPB9G1R_RPB9G1R_SCOM0P1_Val     _UINT32_(0x1)                                        /* (PPS_RPB9G1R) SERCOM0/PAD1  */
#define   PPS_RPB9G1R_RPB9G1R_SCOM1P1_Val     _UINT32_(0x2)                                        /* (PPS_RPB9G1R) SERCOM1/PAD1  */
#define   PPS_RPB9G1R_RPB9G1R_REFO1_Val       _UINT32_(0x3)                                        /* (PPS_RPB9G1R) REFO1  */
#define   PPS_RPB9G1R_RPB9G1R_REFO2_Val       _UINT32_(0x4)                                        /* (PPS_RPB9G1R) REFO2  */
#define   PPS_RPB9G1R_RPB9G1R_REFO3_Val       _UINT32_(0x5)                                        /* (PPS_RPB9G1R) REFO3  */
#define   PPS_RPB9G1R_RPB9G1R_REFO4_Val       _UINT32_(0x6)                                        /* (PPS_RPB9G1R) REFO4  */
#define   PPS_RPB9G1R_RPB9G1R_QSCK_Val        _UINT32_(0x7)                                        /* (PPS_RPB9G1R) QSCK  */
#define PPS_RPB9G1R_RPB9G1R_OFF               (PPS_RPB9G1R_RPB9G1R_OFF_Val << PPS_RPB9G1R_RPB9G1R_Pos) /* (PPS_RPB9G1R) OFF Position  */
#define PPS_RPB9G1R_RPB9G1R_SCOM0P1           (PPS_RPB9G1R_RPB9G1R_SCOM0P1_Val << PPS_RPB9G1R_RPB9G1R_Pos) /* (PPS_RPB9G1R) SERCOM0/PAD1 Position  */
#define PPS_RPB9G1R_RPB9G1R_SCOM1P1           (PPS_RPB9G1R_RPB9G1R_SCOM1P1_Val << PPS_RPB9G1R_RPB9G1R_Pos) /* (PPS_RPB9G1R) SERCOM1/PAD1 Position  */
#define PPS_RPB9G1R_RPB9G1R_REFO1             (PPS_RPB9G1R_RPB9G1R_REFO1_Val << PPS_RPB9G1R_RPB9G1R_Pos) /* (PPS_RPB9G1R) REFO1 Position  */
#define PPS_RPB9G1R_RPB9G1R_REFO2             (PPS_RPB9G1R_RPB9G1R_REFO2_Val << PPS_RPB9G1R_RPB9G1R_Pos) /* (PPS_RPB9G1R) REFO2 Position  */
#define PPS_RPB9G1R_RPB9G1R_REFO3             (PPS_RPB9G1R_RPB9G1R_REFO3_Val << PPS_RPB9G1R_RPB9G1R_Pos) /* (PPS_RPB9G1R) REFO3 Position  */
#define PPS_RPB9G1R_RPB9G1R_REFO4             (PPS_RPB9G1R_RPB9G1R_REFO4_Val << PPS_RPB9G1R_RPB9G1R_Pos) /* (PPS_RPB9G1R) REFO4 Position  */
#define PPS_RPB9G1R_RPB9G1R_QSCK              (PPS_RPB9G1R_RPB9G1R_QSCK_Val << PPS_RPB9G1R_RPB9G1R_Pos) /* (PPS_RPB9G1R) QSCK Position  */
#define PPS_RPB9G1R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_RPB9G1R) Register Mask  */


/* -------- PPS_RPB9G3R : (PPS Offset: 0x2D8) (R/W 32)  -------- */
#define PPS_RPB9G3R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPB9G3R)   Reset Value */

#define PPS_RPB9G3R_RPB9G3R_Pos               _UINT32_(0)                                          /* (PPS_RPB9G3R) RPB9/G3 Position */
#define PPS_RPB9G3R_RPB9G3R_Msk               (_UINT32_(0x1F) << PPS_RPB9G3R_RPB9G3R_Pos)          /* (PPS_RPB9G3R) RPB9/G3 Mask */
#define PPS_RPB9G3R_RPB9G3R(value)            (PPS_RPB9G3R_RPB9G3R_Msk & (_UINT32_(value) << PPS_RPB9G3R_RPB9G3R_Pos)) /* Assigment of value for RPB9G3R in the PPS_RPB9G3R register */
#define   PPS_RPB9G3R_RPB9G3R_OFF_Val         _UINT32_(0x0)                                        /* (PPS_RPB9G3R) OFF  */
#define   PPS_RPB9G3R_RPB9G3R_SCOM0P0_Val     _UINT32_(0x2)                                        /* (PPS_RPB9G3R) SERCOM0/PAD0  */
#define   PPS_RPB9G3R_RPB9G3R_SCOM0P3_Val     _UINT32_(0x3)                                        /* (PPS_RPB9G3R) SERCOM0/PAD3  */
#define   PPS_RPB9G3R_RPB9G3R_SCOM1P2_Val     _UINT32_(0x4)                                        /* (PPS_RPB9G3R) SERCOM1/PAD2  */
#define   PPS_RPB9G3R_RPB9G3R_SCOM1P3_Val     _UINT32_(0x6)                                        /* (PPS_RPB9G3R) SERCOM1/PAD3  */
#define   PPS_RPB9G3R_RPB9G3R_TCC0WO2_Val     _UINT32_(0x7)                                        /* (PPS_RPB9G3R) TCC0/WO2  */
#define   PPS_RPB9G3R_RPB9G3R_TCC0WO0_Val     _UINT32_(0x8)                                        /* (PPS_RPB9G3R) TCC0/WO0  */
#define   PPS_RPB9G3R_RPB9G3R_TCC0WO4_Val     _UINT32_(0x9)                                        /* (PPS_RPB9G3R) TCC0/WO4  */
#define   PPS_RPB9G3R_RPB9G3R_TCC1WO2_Val     _UINT32_(0xA)                                        /* (PPS_RPB9G3R) TCC1/WO2  */
#define   PPS_RPB9G3R_RPB9G3R_TCC1WO0_Val     _UINT32_(0xB)                                        /* (PPS_RPB9G3R) TCC1/WO0  */
#define   PPS_RPB9G3R_RPB9G3R_TCC1WO4_Val     _UINT32_(0xC)                                        /* (PPS_RPB9G3R) TCC1/WO4  */
#define   PPS_RPB9G3R_RPB9G3R_TCC2WO0_Val     _UINT32_(0xD)                                        /* (PPS_RPB9G3R) TCC2/WO0  */
#define   PPS_RPB9G3R_RPB9G3R_TC0WO0_Val      _UINT32_(0xF)                                        /* (PPS_RPB9G3R) TC0/WO0  */
#define   PPS_RPB9G3R_RPB9G3R_TC1WO0_Val      _UINT32_(0x10)                                       /* (PPS_RPB9G3R) TC1/WO0  */
#define   PPS_RPB9G3R_RPB9G3R_TC2WO0_Val      _UINT32_(0x11)                                       /* (PPS_RPB9G3R) TC2/WO0  */
#define   PPS_RPB9G3R_RPB9G3R_TC3WO0_Val      _UINT32_(0x12)                                       /* (PPS_RPB9G3R) TC3/WO0  */
#define   PPS_RPB9G3R_RPB9G3R_TC4WO0_Val      _UINT32_(0x13)                                       /* (PPS_RPB9G3R) TC4/WO0  */
#define   PPS_RPB9G3R_RPB9G3R_TC5WO0_Val      _UINT32_(0x14)                                       /* (PPS_RPB9G3R) TC5/WO0  */
#define   PPS_RPB9G3R_RPB9G3R_TC6WO0_Val      _UINT32_(0x15)                                       /* (PPS_RPB9G3R) TC6/WO0  */
#define   PPS_RPB9G3R_RPB9G3R_TC7WO0_Val      _UINT32_(0x16)                                       /* (PPS_RPB9G3R) TC7/WO0  */
#define   PPS_RPB9G3R_RPB9G3R_QCS_Val         _UINT32_(0x17)                                       /* (PPS_RPB9G3R) QCS  */
#define   PPS_RPB9G3R_RPB9G3R_QD1_Val         _UINT32_(0x18)                                       /* (PPS_RPB9G3R) QD1  */
#define   PPS_RPB9G3R_RPB9G3R_QD0_Val         _UINT32_(0x19)                                       /* (PPS_RPB9G3R) QD0  */
#define   PPS_RPB9G3R_RPB9G3R_QD3_Val         _UINT32_(0x1A)                                       /* (PPS_RPB9G3R) QD3  */
#define   PPS_RPB9G3R_RPB9G3R_CCLOUT0_Val     _UINT32_(0x1B)                                       /* (PPS_RPB9G3R) CCLOUT0  */
#define   PPS_RPB9G3R_RPB9G3R_TSTBUS1_Val     _UINT32_(0x1C)                                       /* (PPS_RPB9G3R) TSTBUS1  */
#define   PPS_RPB9G3R_RPB9G3R_TSTBUS4_Val     _UINT32_(0x1D)                                       /* (PPS_RPB9G3R) TSTBUS4  */
#define   PPS_RPB9G3R_RPB9G3R_TSTBUS7_Val     _UINT32_(0x1E)                                       /* (PPS_RPB9G3R) TSTBUS7  */
#define   PPS_RPB9G3R_RPB9G3R_TSTBUS10_Val    _UINT32_(0x1F)                                       /* (PPS_RPB9G3R) TSTBUS10  */
#define PPS_RPB9G3R_RPB9G3R_OFF               (PPS_RPB9G3R_RPB9G3R_OFF_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) OFF Position  */
#define PPS_RPB9G3R_RPB9G3R_SCOM0P0           (PPS_RPB9G3R_RPB9G3R_SCOM0P0_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) SERCOM0/PAD0 Position  */
#define PPS_RPB9G3R_RPB9G3R_SCOM0P3           (PPS_RPB9G3R_RPB9G3R_SCOM0P3_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) SERCOM0/PAD3 Position  */
#define PPS_RPB9G3R_RPB9G3R_SCOM1P2           (PPS_RPB9G3R_RPB9G3R_SCOM1P2_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) SERCOM1/PAD2 Position  */
#define PPS_RPB9G3R_RPB9G3R_SCOM1P3           (PPS_RPB9G3R_RPB9G3R_SCOM1P3_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) SERCOM1/PAD3 Position  */
#define PPS_RPB9G3R_RPB9G3R_TCC0WO2           (PPS_RPB9G3R_RPB9G3R_TCC0WO2_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TCC0/WO2 Position  */
#define PPS_RPB9G3R_RPB9G3R_TCC0WO0           (PPS_RPB9G3R_RPB9G3R_TCC0WO0_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TCC0/WO0 Position  */
#define PPS_RPB9G3R_RPB9G3R_TCC0WO4           (PPS_RPB9G3R_RPB9G3R_TCC0WO4_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TCC0/WO4 Position  */
#define PPS_RPB9G3R_RPB9G3R_TCC1WO2           (PPS_RPB9G3R_RPB9G3R_TCC1WO2_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TCC1/WO2 Position  */
#define PPS_RPB9G3R_RPB9G3R_TCC1WO0           (PPS_RPB9G3R_RPB9G3R_TCC1WO0_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TCC1/WO0 Position  */
#define PPS_RPB9G3R_RPB9G3R_TCC1WO4           (PPS_RPB9G3R_RPB9G3R_TCC1WO4_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TCC1/WO4 Position  */
#define PPS_RPB9G3R_RPB9G3R_TCC2WO0           (PPS_RPB9G3R_RPB9G3R_TCC2WO0_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TCC2/WO0 Position  */
#define PPS_RPB9G3R_RPB9G3R_TC0WO0            (PPS_RPB9G3R_RPB9G3R_TC0WO0_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TC0/WO0 Position  */
#define PPS_RPB9G3R_RPB9G3R_TC1WO0            (PPS_RPB9G3R_RPB9G3R_TC1WO0_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TC1/WO0 Position  */
#define PPS_RPB9G3R_RPB9G3R_TC2WO0            (PPS_RPB9G3R_RPB9G3R_TC2WO0_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TC2/WO0 Position  */
#define PPS_RPB9G3R_RPB9G3R_TC3WO0            (PPS_RPB9G3R_RPB9G3R_TC3WO0_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TC3/WO0 Position  */
#define PPS_RPB9G3R_RPB9G3R_TC4WO0            (PPS_RPB9G3R_RPB9G3R_TC4WO0_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TC4/WO0 Position  */
#define PPS_RPB9G3R_RPB9G3R_TC5WO0            (PPS_RPB9G3R_RPB9G3R_TC5WO0_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TC5/WO0 Position  */
#define PPS_RPB9G3R_RPB9G3R_TC6WO0            (PPS_RPB9G3R_RPB9G3R_TC6WO0_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TC6/WO0 Position  */
#define PPS_RPB9G3R_RPB9G3R_TC7WO0            (PPS_RPB9G3R_RPB9G3R_TC7WO0_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TC7/WO0 Position  */
#define PPS_RPB9G3R_RPB9G3R_QCS               (PPS_RPB9G3R_RPB9G3R_QCS_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) QCS Position  */
#define PPS_RPB9G3R_RPB9G3R_QD1               (PPS_RPB9G3R_RPB9G3R_QD1_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) QD1 Position  */
#define PPS_RPB9G3R_RPB9G3R_QD0               (PPS_RPB9G3R_RPB9G3R_QD0_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) QD0 Position  */
#define PPS_RPB9G3R_RPB9G3R_QD3               (PPS_RPB9G3R_RPB9G3R_QD3_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) QD3 Position  */
#define PPS_RPB9G3R_RPB9G3R_CCLOUT0           (PPS_RPB9G3R_RPB9G3R_CCLOUT0_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) CCLOUT0 Position  */
#define PPS_RPB9G3R_RPB9G3R_TSTBUS1           (PPS_RPB9G3R_RPB9G3R_TSTBUS1_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TSTBUS1 Position  */
#define PPS_RPB9G3R_RPB9G3R_TSTBUS4           (PPS_RPB9G3R_RPB9G3R_TSTBUS4_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TSTBUS4 Position  */
#define PPS_RPB9G3R_RPB9G3R_TSTBUS7           (PPS_RPB9G3R_RPB9G3R_TSTBUS7_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TSTBUS7 Position  */
#define PPS_RPB9G3R_RPB9G3R_TSTBUS10          (PPS_RPB9G3R_RPB9G3R_TSTBUS10_Val << PPS_RPB9G3R_RPB9G3R_Pos) /* (PPS_RPB9G3R) TSTBUS10 Position  */
#define PPS_RPB9G3R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_RPB9G3R) Register Mask  */


/* -------- PPS_RPB10G3R : (PPS Offset: 0x2DC) (R/W 32)  -------- */
#define PPS_RPB10G3R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_RPB10G3R)   Reset Value */

